/**
 *  任务名称:侦探初体验
 地区:益州、成都城
 任务条件:Lv.25
 流程:
 1.到益州成都城广场与莫大哥交谈，答应协助。
 2.前往青城山脚，在半路会与莫大哥交谈。
 3.再到外水桥，在桥上会与莫大哥交谈。
 4.靠近右边的传点时，会捡到小酒杯。
 5.再与莫大哥交谈，选择小狗子。
 6.回到成都城客栈与小狗子交谈即可完成任务。
 任务奖品:随机获得：+1属性羽毛
 备注:

 任务名称:离奇命案
 地区:益州、成都城
 任务条件:需完成「侦探初体验」的任务
 流程:
 1.到益州的成都城客栈与小狗子交谈。
 2.前往白帝城与宫卫队交谈，得到【稻草人娃娃x1】。
 3.前往成都城茶店，变身成为稻草人，走到(1200.355)的位置，会与飘光斩x5进入战斗。
 4.胜利后即可完成任务。
 任务奖品:随机获得：骏马x1、醍醐丹x10
 备注:

 任务名称:曹操兴兵取汉中
 地区:兖州、许昌城
 任务条件:LV25
 流程:
 1.至许昌皇宫与曹操交谈后，答应协助。
 2.分别前往陈留城门与夏侯淳、汜水关曹仁交谈后，返回许昌。
 3.接近曹操家前时触发交谈后，会与曹仁进行战斗(需一回合内完成)。
 4.胜利后前往皇宫与曹操交谈，即可完成任务。

 任务奖品:经验值若干(0.8%)、[随机取得]仙山灵蔘x25、青壶药水x25
 备注:

 任务名称:初战汉中
 地区:兖州、许昌城
 任务条件:须完成「曹操兴兵取汉中」的任务
 流程:
 1.完成曹操兴兵取汉中任务后会立即触发，答应协助。
 2.前往斜谷树林4(左偏将场景，4720,350)时触发交谈后，会与杨任、杨昂、益州兵x2、南郑兵x2进行战斗。
 3.胜利后前往益州北山寨触发交谈，答应协助。
 4.前往北山脚(箭楼下方)触发交谈后，再移动至右上方触发交谈，会与杨任、杨昂、蜀兵x2、汉中兵x2进行战斗(须五回合内完成)。
 5.胜利后前往北山寨触发交谈后，即可完成任务。

 任务奖品:经验值若干(0.3%)、[随机取得]五爪龙布x10、天蚕精纱x10
 备注:

 任务名称:夺取阳平关
 地区:益州、北山寨
 任务条件:须完成「曹操兴兵取汉中」的任务
 流程:
 1.至北山寨与曹操交谈，再与其交谈后答应协助。
 2.前往北山小径(北山脚右下方进入第2场景)触发交谈后，再与夏侯淳交谈答应协助。
 3.进入寨门与小兵交谈后，再进入右上场景与夏侯渊交谈，会与杨任、丝路兵x2、巡境骑x3进行战斗。
 4.胜利后返回与夏侯渊交谈，再到寨门场景触发交谈后，会与杨昂、风速骑x3、军屯兵x4进行战斗。
 5.胜利后返回与夏侯渊交谈，前往北山寨与曹操交谈2次后答应协助。
 6.至北山树林(北山脚右下方进入第1场景)触发交谈后，会与杨任、巡境骑x6、军屯兵x3(增援：军屯兵5)进行战斗。
 7.胜利后即可完成任务。

 任务奖品:经验值若干(2%)
 备注:

 任务名称:庞德归降
 地区:益州、南郑城
 任务条件:须完成「夺取阳平关」的任务
 流程:
 1.前往南郑树林栅栏(560,550)触发交谈后，再到南郑寨栅栏(1000,600)触发交谈，答应协助(取得【金掩甲】)。
 2.于南郑寨右下方与老工匠交谈后，取得【南郑皮甲】并装备。(如无装备会在城门下与南郑兵x20进行战斗)
 3.进入南郑街道普户内与杨松交谈后(须装备【南郑皮甲】)，再到南郑树林栅栏触发交谈，答应协助。
 4.进入南郑山道触发交谈后，会与庞德、连拳士x2、铁枪卫士x2进行战斗(需三回合内完成)。
 5.战斗胜利后，即可完成任务。

 任务奖品:福神纹章(不可转让)、特级药丹x50
 备注:

 任务名称:曹操定汉中
 地区:益州、南郑寨
 任务条件:需完成「庞德归降」的任务
 流程:
 1.与南郑寨右上方的曹操交谈后，答应协助。
 2.前往南郑树林(850,750)与曹操交谈后，进入南郑城。
 3.与城门前的张卫交谈后，会与张卫、南郑兵x4、南郑守兵进行战斗(须五回合完成)。
 4.胜利后前往南郑街道(200,450)与张鲁交谈，会与张鲁、张卫、阎圃、南郑兵x5进行战斗(须五回合完成)。
 5.战斗胜利后再移动一次(200,450)与曹操交谈，答应协助(取得「娟红水晶」)。
 6.前往巴山树林(大地图北山脚左方)左上方与张鲁交谈后，答应杨松的请求(取得【杨松密函】)。
 7.返回南郑寨与曹操交谈后，前往巴山树林会与杜濩、朴胡、巴山蛮兵x8进行战斗(增援：张鲁)。
 8.战斗胜利后到(980,940)触发交谈，即可完成任务。

 任务奖品:经验值若干(1%)、[随机取得]LV96盾剑(攻+22、防+6)、醍醐丹x30
 备注:


 任务名称:瓦口大战
 地区:益州、成都城
 任务条件:需完成「曹操定汉中」的任务
 流程:
 1.进入成都官府与諸葛亮交谈后，取得【!成都佳酿】并答应协助。
 2.前往瓦口树林左上方与张飞交谈后，答应收集一個「!稻草人娃娃」(夷州大地图-稻草人娃娃)。
 3.取得道具后再返回与张飞交谈后，往右移动一下触发剧情后，会于张郃、征军校x5进行战斗(需五回合完成)。
 4.战斗胜利后返回成都官府与諸葛亮交谈，即可完成任務。
 任务奖品:经验值若干(0.5%)、[隨机取得]白蛇怒(知+31、敏+4,LV50)、回意錦囊、三思錦囊
 备注:无

 任务名称:张飞斗张合
 地区:益州、瓦口树林
 任务条件:需完成「瓦口大战」的任务
 流程:
 1.前往瓦口树林(炎汉战士场景)左上方与张飞交谈后，答应协助。
 2.沿着瓦口栈道、瓦口栈道2路上皆会在该场景与瓦口伏兵x?(有增援,乱敏)进行战斗。
 3.战斗结束后前往瓦口关阶梯中间触发交谈，会与张郃、瓦口伏兵x5进行战斗。
 4.战斗结束后返回瓦口树林与张飞交谈，再前往瓦口关。
 5.移动到瓦口关阶梯中间触发剧情后，会与瓦口守兵、瓦口伏兵x5(增援：瓦口伏兵x4)进行战斗。
 6.战斗结束后，即可完成任务
 任务奖品:经验值若干(2%)
 备注:

 任务名称:黄忠智守葭萌关
 地区:益州、成都城
 任务条件:需完成「张飞斗张郃」的任务
 流程:
 1.前往成都官府与法正交谈后，答应协助。
 2.前往葭萌关(霍峻场景)与霍峻交谈后，前往葭萌栈道2触发剧情，会与南郑精兵x5进行战斗。
 3.战斗结束后前往葭萌树林(铁叉军场景)触发剧情，会与韩浩、夏侯尚、南郑精兵x5进行战斗(可遁逃)。
 4.战斗结束后前往葭萌栈道路上触发剧情，会与韩浩、夏侯尚、南郑精兵x4进行战斗(可遁逃)。
 5.战斗结束后前往葭萌栈道2路上触发剧情，会与韩浩、夏侯尚、南郑精兵x5进行战斗(可遁逃)。
 6.战斗结束后前往葭萌树林2(猛羌将场景)左上传送点触发剧情，先进入传送点再返回葭萌树林2。
 7.移动到(300,300)触发剧情后，会与韩浩、夏侯尚、南郑精兵x8进行战斗。
 8.战斗结束后，即可完成任务。
 任务奖品:经验值若干(0.5%)、晨曦冰晶(心+11)x2
 备注:


 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 * 任务名称:大商人杜魯尼
 地区:絲路、疏勒城
 任务条件:LV25
 流程:
 1.進入疏勒客棧與杜魯尼交談後，答應協助。
 2.至于闐礦坑收集10個「尾指金片」後，返回與其交談再答應協助。
 3.再收集5個「玄光水晶」、1個「雞血石」後，返回與其交談並付200金。
 4.前往疏勒城門觸發交談後，即可完成任務。
 任务奖品:杜魯尼的短刀
 备注:

 任务名称:強渡玉門關
 地区:西域、伊吾盧城
 任务条件:須完成「大商人杜魯尼」的任務
 流程:
 1.前往伊吾盧城門與杜魯尼交談後，答應協助。
 2.進入城內與錢莊前的屯田兵交談後，給他100金獲得情報。
 3.前往伊無盧廣場(屯田兵左方)小屋內，與老學究交談給他【杜魯尼的短刀】後，答應協助。
 4.至伊吾盧綠洲打怪收集2個「西域香瓜」後返回與老學究交談，獲得【通關證明】及4個西域香瓜。
 5.返回伊吾盧城門與杜魯尼交談後，前往玉門關觸發交談，會與守關士卒x6進行戰鬥(需三回合內完成)。
 6.戰鬥勝利後，即可完成任務。

 任务奖品:西域香瓜x4、杜魯尼的頭盔
 备注:
 任务名称:杜魯尼的報恩
 地区:涼州、居延砦
 任务条件:需完成「強渡玉門關」的任務
 流程:
 1.進入居延砦觸發劇情後，答應其所需的物品。
 火系：「娟紅水晶」(8級礦)x15、烽火燎原符x5
 地系：「英雄膽」(交州朱崖竹林2-鉤刀將)x5、天崩地裂符x15
 水系：「陰河黑石」(幽暗鬼城可一次撿拾4個)x8、冰封符x12
 風系：「風靈珠」x2、亂擊符x18
 2.收集齊全後再跟杜魯尼交談，撿拾該場景的百斤鐵鎚。
 3.取得之後再與其交談，將【杜魯尼的頭盔】給他後，即可完成任務。

 任务奖品:神秘假面(攻+7、敏+1,LV15，若不慎遺失可再次收集相同物品向他換得)
 备注:



 任务名称:桃花源之危
 地区:荊南、桃花源
 任务条件:需完成「杜鲁泥的报恩」的任务
 流程:
 1.进入桃花源村与阿国交谈后，答应协助。
 2.前往武陵寨(450,850)触发交谈后，会与恶家仆x4进行战斗。
 3.战斗胜利后移动到(1050,800)触发交谈，会与恶家仆x6进行战斗。
 4.战斗胜利后再移动到(550,450)触发交谈，会与恶家仆x6进行战斗。
 5.战斗胜利后前往武陵寨2触发交谈，会与恶家仆x8进行战斗。
 6.战斗胜利后再移动到(650,550)触发交谈，会与恶家仆x8进行战斗。
 7.战斗胜利后与杜鲁尼交谈，返回桃花源村与阿国交谈后与小雄、慧慧、侯大媽、甘始进行战斗(逃跑即失败)。
 8.战斗胜利后，即可完成任务；若失败的话答应找回村民。
 9.分別前往找鮑家村的倪老夜、长沙的刘师傅、马王堆墓穴的黃小哥交谈。
 10.返回桃花源村与阿国交谈后，即可完成任务。
 任务奖品:打贏村民：[隨机取得]闪光羽毛(?+6)、幻影羽毛(?+7)、找寻村民：[隨机取得]月讀羽毛(?+11)
 备注:

 * Date: 2017/4/26
 * Time: 16:28
 *
 * @author Tian.Dong
 */
package tk.gbl.core.script.work.shiyixin;