package tk.gbl.core.script.work.shiyixin;

import tk.gbl.core.GameClient;
import tk.gbl.core.ScriptAction;

import java.io.IOException;

/**
 * 任务名称:侦探初体验
 * 地区:益州、成都城
 * 任务条件:Lv.25
 * 流程:
 * 1.到益州成都城广场与莫大哥交谈，答应协助。
 * 2.前往青城山脚，在半路会与莫大哥交谈。
 * 3.再到外水桥，在桥上会与莫大哥交谈。
 * 4.靠近右边的传点时，会捡到小酒杯。
 * 5.再与莫大哥交谈，选择小狗子。
 * 6.回到成都城客栈与小狗子交谈即可完成任务。
 * 任务奖品:随机获得：+1属性羽毛
 * 备注:
 * <p/>
 * 任务名称:离奇命案
 * 地区:益州、成都城
 * 任务条件:需完成「侦探初体验」的任务
 * 流程:
 * 1.到益州的成都城客栈与小狗子交谈。
 * 2.前往白帝城与宫卫队交谈，得到【稻草人娃娃x1】。//做到这里
 * 3.前往成都城茶店，变身成为稻草人，走到(1200.355)的位置，会与飘光斩x5进入战斗。
 * 4.胜利后即可完成任务。
 * 任务奖品:随机获得：骏马x1、醍醐丹x10
 * 备注:
 * <p/>
 * Date: 2017/5/25
 * Time: 19:11
 *
 * @author Tian.Dong
 */
public class X0_getDaocaorenwawa extends ScriptAction {
    @Override
    public void doAction(GameClient gameClient) throws IOException {
        String steps = "侦探初体验-莫大哥=25003=3=190,560=0=0==0\n" +
                "侦探初体验-青城山=25471=0=690,550=1=3==0\n" +
                "侦探初体验-都江堰=25491=0=260,360=1=3==0\n" +
                "侦探初体验-都江堰2=25491=0=260,360=1=4==0\n" +
                "侦探初体验-都江堰3=25491=1=540,470=0=0=2=0\n" +
                "侦探初体验-小狗子=25241=2=830,560=0=0==0\n" +
                "离奇命案-小狗子=25241=2=830,560=0=0==0\n" +
                "离奇命案-稻草人娃娃=25023=3=490,360=0=0==0";
        String steps2 = "1侦探初体验-25003=25003=3=190,560=0=0=0=0\n" +
                "2侦探初体验-25471=25471=0=682,555=1=3=0=0\n" +
                "3侦探初体验-25491=25491=0=1162,755=1=3=0=0\n" +
                "4侦探初体验-25491=25491=0=1162,755=1=4=0=0\n" +
                "5侦探初体验-25491=25491=1=470,460=0=0=2=0\n" +
                "6侦探初体验-25241=25241=2=830,560=0=0=0=0\n" +
                "1离奇命案-25241=25241=2=830,560=0=0=0=0\n" +
                "2离奇命案-25023=25023=3=490,360=0=0=0=0";

        for(String step:steps.split("\n")) {
            gameClient.doDoDoScriptAction(step);
        }
        System.out.println("完成稻草人娃娃");
    }
}
