package tk.gbl.core.script.work.shiyixin;

import tk.gbl.core.GameClient;
import tk.gbl.core.ScriptAction;

import java.io.IOException;

/**
 * 任务名称:夺取阳平关
 * 地区:益州、北山寨
 * 任务条件:须完成「曹操兴兵取汉中」的任务
 * 流程:
 * 1.至25822北山寨与曹操交谈，再与其交谈后答应协助。
 * 2.前往北山小径(北山脚右下方进入第2场景)触发交谈后，再与夏侯淳交谈答应协助。
 * 3.进入25816寨门与小兵交谈后，再进入右上场景与夏侯渊交谈，会与杨任、丝路兵x2、巡境骑x3进行战斗。
 * 4.胜利后返回与夏侯渊交谈，再到寨门场景触发交谈后，会与杨昂、风速骑x3、军屯兵x4进行战斗。
 * 5.胜利后返回与夏侯渊交谈，前往北山寨与曹操交谈2次后答应协助。
 * 6.至北山树林(北山脚右下方进入第1场景)触发交谈后，会与杨任、巡境骑x6、军屯兵x3(增援：军屯兵5)进行战斗。
 * 7.胜利后即可完成任务。
 * <p/>
 * 任务奖品:经验值若干(2%)
 * 备注:
 * <p/>
 * Date: 2017/5/25
 * Time: 19:25
 *
 * @author Tian.Dong
 */
public class X3_duoquyangpingguan extends ScriptAction {
    @Override
    public void doAction(GameClient gameClient) throws IOException {
        String steps222 = "奪取陽平關-北山寨曹操=25822=10=1262,495=0=0==0\n" +
                "奪取陽平關-北山小径=25828=0=90,390=1=3==0\n" +
                "奪取陽平關-阳平小兵=25816=1=150,490=0=0==0\n" +
                "奪取陽平關-夏侯渊=25817=1=330,560=0=0==0\n" +
                "奪取陽平關-杨昂=25816=0=710,110=1=3==0\n" +
                "奪取陽平關-北山树林=25827=0=1330,1190=1=3==0";

        String steps = "1夺取阳平关-25822=25822=10=1310,460=0=0=0=0\n" +//
                "2夺取阳平关-25822=25822=10=1310,460=0=0=0=0\n" +//
                "3夺取阳平关-25828=25828=0=82,395=1=3=0=0\n" +
                "4夺取阳平关-25828=25828=1=230,420=0=0=0=0\n" +
                "5夺取阳平关-25816=25816=1=290,380=0=0=0=0\n" +
                "6夺取阳平关-25817=25817=1=330,560=0=0=0=0\n" +
                "7夺取阳平关-25816=25816=0=702,115=1=3=0=0\n" +
                "8夺取阳平关-25817=25817=1=330,560=0=0=0=0\n" +
                "9夺取阳平关-25822=25822=10=1310,460=0=0=0=0\n" +
                "10夺取阳平关-25822=25822=10=1310,460=0=0=0=0\n" +
                "11夺取阳平关-25827=25827=0=302,275=1=3=0=0";

        for (String step : steps.split("\n")) {
            gameClient.doDoDoScriptAction(step);
        }
        System.out.println("完成夺取阳平关");
    }
}
