package tk.gbl.core.script.work.shiyixin;

import tk.gbl.core.GameClient;
import tk.gbl.core.ScriptAction;

import java.io.IOException;

/**
 * 任务名称:庞德归降
 * 地区:益州、南郑城
 * 任务条件:须完成「夺取阳平关」的任务
 * 流程:
 * 1.前往南郑树林栅栏(560,550)触发交谈后，再到南郑寨栅栏(1000,600)触发交谈，答应协助(取得【金掩甲】)。
 * 2.于南郑寨右下方与老工匠交谈后，取得【南郑皮甲】并装备。(如无装备会在城门下与南郑兵x20进行战斗)
 * 3.进入南郑街道普户内与杨松交谈后(须装备【南郑皮甲】)，再到南郑树林栅栏触发交谈，答应协助。
 * 4.进入南郑山道触发交谈后，会与庞德、连拳士x2、铁枪卫士x2进行战斗(需三回合内完成)。
 * 5.战斗胜利后，即可完成任务。
 * <p/>
 * 任务奖品:福神纹章(不可转让)、特级药丹x50
 * 备注:
 * <p/>
 * Date: 2017/5/25
 * Time: 19:26
 *
 * @author Tian.Dong
 */
public class X4_pangdeguixiang extends ScriptAction {
    @Override
    public void doAction(GameClient gameClient) throws IOException {
        String steps222 = "龐德歸降-南郑树林=25731=0=720,620=1=4==0\n" +
                "龐德歸降-南郑寨=25733=0=1080,640=1=2==0\n" +
                "龐德歸降-南郑工匠=25733=11=2020,1420=0=0==0\n" +
                "龐德歸降-南郑城门=25011=0=540,800=1=3==0\n" +
                "龐德歸降-南郑杨松=25136=1=450,390=0=0==0\n" +
                "龐德歸降-南郑山道=25732=0=150,3110=1=3==0";

        String steps = "1庞德归降-25731=25731=0=1482,3795=1=4=0=0\n" +
                "2庞德归降-25733=25733=0=2182,1815=1=2=0=0\n" +
                "3庞德归降-25733=25733=11=2130,1420=0=0=0=0\n" +//取得南郑皮甲
                "装备南郑皮甲=equip-19045=0=822,635=1=3=0=0\n" +//装备南郑皮甲
                "4庞德归降-25011=25011=0=822,635=1=3=0=0\n" +
                "5庞德归降-25136=25136=1=342,315=0=0=0=0\n" +
                "6庞德归降-25731=25731=0=222,215=1=4=0=0\n" +
                "7庞德归降-25732=25732=0=142,3115=1=3=0=0";

        for (String step : steps.split("\n")) {
            gameClient.doDoDoScriptAction(step);
        }
        System.out.println("完成庞德归降");
    }
}