package tk.gbl.core.script.work.shiyixin;

import tk.gbl.core.GameClient;
import tk.gbl.core.ScriptAction;

import java.io.IOException;

/**
 * 任务名称:曹操定汉中
 * 地区:益州、南郑寨
 * 任务条件:需完成「庞德归降」的任务
 * 流程:
 * 1.与南郑寨右上方的曹操交谈后，答应协助。
 * 2.前往南郑树林(850,750)与曹操交谈后，进入南郑城。
 * 3.与城门前的张卫交谈后，会与张卫、南郑兵x4、南郑守兵进行战斗(须五回合完成)。
 * 4.胜利后前往南郑街道(200,450)与张鲁交谈，会与张鲁、张卫、阎圃、南郑兵x5进行战斗(须五回合完成)。
 * 5.战斗胜利后再移动一次(200,450)与曹操交谈，答应协助(取得「娟红水晶」)。
 * 6.前往巴山树林(大地图北山脚左方)左上方与张鲁交谈后，答应杨松的请求(取得【杨松密函】)。
 * 7.返回南郑寨与曹操交谈后，前往巴山树林会与杜濩、朴胡、巴山蛮兵x8进行战斗(增援：张鲁)。
 * 8.战斗胜利后到(980,940)触发交谈，即可完成任务。
 * <p/>
 * 任务奖品:经验值若干(1%)、[随机取得]LV96盾剑(攻+22、防+6)、醍醐丹x30
 * 备注:
 * <p/>
 * Date: 2017/5/25
 * Time: 19:26
 *
 * @author Tian.Dong
 */
public class X5_caocaodinghanzhong extends ScriptAction {
    @Override
    public void doAction(GameClient gameClient) throws IOException {
        String steps222 = "曹操定漢中-曹操=25733=12=2242,415=0=0==0\n" +
                "曹操定漢中-南郑=25731=8=542,495=1=5==0\n" +
                "曹操定漢中-曹操2=25731=8=690,640=0=0==0\n" +
                "曹操定漢中-南郑城门=25011=0=830,630=1=4==0\n" +
                "曹操定漢中-张卫=25011=11=570,560=0=0==0\n" +
                "曹操定漢中-张鲁=25013=0=150,470=1=9==0\n" +
                "曹操定漢中-巴山树林=25807=1=820,480=0=0==0\n" +
                "曹操定漢中-巴山激战=25807=0=2110,1790=1=2==0\n" +
                "曹操定漢中-巴山交任务=25807=0=980,940=1=3==0";

        String steps = "1曹操定汉中-25733=25733=12=2310,400=0=0=0=0\n" +
                "2曹操定汉中-25731=25731=0=1542,255=1=5=0=0\n" +
                "3曹操定汉中-25731=25731=8=690,640=0=0=0=0\n" +
                "4曹操定汉中-25011=25011=0=822,635=1=4=0=0\n" +
                "5曹操定汉中-25011=25011=11=570,560=0=0=0=0\n" +
                "6曹操定汉中-25013=25013=0=142,475=1=9=0=0\n" +
                "7曹操定汉中-25013=25013=0=142,475=1=9=0=0\n" +
                "8曹操定汉中-25807=25807=1=730,440=0=0=0=0\n" +
                "9曹操定汉中-25733=25733=12=2310,400=0=0=0=0\n" +
                "10曹操定汉中-25807=25807=0=2102,1795=1=2=0=0\n" +
                "11曹操定汉中-25807=25807=0=2102,1795=1=3=0=0";

        for (String step : steps.split("\n")) {
            gameClient.doDoDoScriptAction(step);
        }
        System.out.println("完成曹操定汉中");
    }
}