package tk.gbl.core.script.work.shiyixin;

import tk.gbl.core.GameClient;
import tk.gbl.core.ScriptAction;

import java.io.IOException;

/**
 * 南鄭精兵|43043
 * 任务名称:黄忠智守葭萌关
 * 地区:益州、成都城
 * 任务条件:需完成「张飞斗张郃」的任务
 * 流程:
 * 1.前往成都官府与法正交谈后，答应协助。
 * 2.前往葭萌关(霍峻场景)与霍峻交谈后，前往葭萌栈道2触发剧情，会与南郑精兵x5进行战斗。
 * 3.战斗结束后前往葭萌树林(铁叉军场景)触发剧情，会与韩浩、夏侯尚、南郑精兵x5进行战斗(可遁逃)。
 * 4.战斗结束后前往葭萌栈道路上触发剧情，会与韩浩、夏侯尚、南郑精兵x4进行战斗(可遁逃)。
 * 5.战斗结束后前往葭萌栈道2路上触发剧情，会与韩浩、夏侯尚、南郑精兵x5进行战斗(可遁逃)。
 * 6.战斗结束后前往葭萌树林2(猛羌将场景)左上传送点触发剧情，先进入传送点再返回葭萌树林2。
 * 7.移动到(300,300)触发剧情后，会与韩浩、夏侯尚、南郑精兵x8进行战斗。
 * 8.战斗结束后，即可完成任务。
 * 任务奖品:经验值若干(0.5%)、晨曦冰晶(心+11)x2
 * 备注:
 * <p/>
 * Date: 2017/5/25
 * Time: 19:27
 *
 * @author Tian.Dong
 */
public class X8_huangzhongzhishoujianjiaguan extends ScriptAction {
    @Override
    public void doAction(GameClient gameClient) throws IOException {
        String steps222 = "黃忠智守葭萌关-成都法正=25301=9=390,380=0=0==0\n" +
                "黃忠智守葭萌关-霍峻1=25411=2=322,675=1=3==0\n" +
                "黃忠智守葭萌关-霍峻=25411=2=390,500=0=3==0\n" +
                "黃忠智守葭萌关-葭萌栈道=25417=0=749,422=1=3==0\n" +
                "黃忠智守葭萌关-葭萌树林=25419=0=210,210=1=5==0\n" +
                "黃忠智守葭萌关-葭萌栈道韩浩=25418=0=680,3800=1=3==0\n" +
                "黃忠智守葭萌关-葭萌栈道夏侯尚=25417=0=460,560=1=4==0\n" +
                "黃忠智守葭萌关-葭萌树林黄忠=25415=0=300,300=1=6==0\n" +
                "黃忠智守葭萌关-葭萌心11=25415=0=210,210=1=5==0";

        String steps = "1黄忠智守霞萌关-25301=25301=9=330,440=0=0=0=0\n" +
                "2黄忠智守霞萌关-25411=25411=0=202,895=1=3=0=0\n" +
                "3黄忠智守霞萌关-25411=25411=2=390,500=0=0=0=0\n" +
                "4黄忠智守霞萌关-25417=25417=0=242,775=1=3=0=0\n" +
                "5黄忠智守霞萌关-25419(遁逃)=25419=0=202,1835=1=5=0=0\n" +
                "6黄忠智守霞萌关-25418(遁逃)=25418=0=1502,95=1=3=0=0\n" +
                "7黄忠智守霞萌关-25417(遁逃)=25417=0=1482,175=1=4=0=0\n" +
                "8黄忠智守霞萌关-25415=25415=0=300,300=1=6=0=0\n" +
//                "9黄忠智守霞萌关-25415=25415=0=3202,295=1=3=0=0\n" +
//                "10黄忠智守霞萌关-25413=25413=0=662,955=1=2=0=0\n" +
                "11黄忠智守霞萌关-25415=25415=0=202,215=1=5=0=0";

        for (String step : steps.split("\n")) {
            gameClient.doDoDoScriptAction(step);
        }
        System.out.println("完成黄忠智守葭萌关");
    }
}