package tk.gbl.core.script.work.shimao;

/**
 * 任务名称:三江城大战
 * 地区:南中、西银冶雨林
 * 任务条件:需完成“薤叶芸香”的任务
 * 流程:
 * 1.前往西银冶雨林(雨林小径2左上传点)军帐内与杨发交谈后，再与杨宇交谈并答应协助。
 * 2.将5根“夫余松枝(峻谷兵)”、1块“野兽皮”、3匹“纷彩织布(掷标队)”搜集齐全后返回与杨宇交谈，取得“杨阎娃娃”并答应协助。
 * 3.变身后前往秃龙寨与朵思大王交谈后，会与孟获进行战斗(需两回合内完成)。
 * 4.战斗胜利后前往竹山(左进场景)与诸葛亮交谈，答应协助。
 * 5.前往九十三甸雨林右上方与魏延交谈后，答应搜集20匹“粗麻布(乌桓勇士)”。
 * 6.搜集齐全后返回九十三甸雨林(2200,450)触发交谈，获得【铲子】并答应协助。
 * 7.移动到(1900,300)后获得20个【包土麻袋】，再与魏延交谈并答应协助。
 * 8.到三江城门下触发交谈，再前往三江广场与豚蛮酋长交谈后，会与狼蛮卒x2、豚蛮卒x2、狼蛮酋长x3、豚蛮酋长x3(增援:豚蛮卒x2、狼蛮卒x2、狼蛮酋长x1、豚蛮酋长1)进行战斗。
 * 9.战斗胜利后进入三江富户与朵思大王交谈，会与朵思大王、三江蛮兵x9(增援:三江蛮兵x9)进行战斗。
 * 10.战斗胜利后，即可完成任务。
 * 任务奖品:[随机取得]孜然牛腿x10(不可交易)
 * 备注:
 * <p/>
 * Date: 2017/5/21
 * Time: 8:53
 *
 * @author Tian.Dong
 */
public class T10_sanjiangchengdazhan {
}
