package tk.gbl.core.script.work.shimao;

/**
 * 任务名称:六擒孟获
 * 地区:南中、棕榈雨林
 * 任务条件:需完成“三江城大战”的任务
 * 流程:
 * 1.到棕榈雨林移动到(1900,1450)触发交谈后，答应协助。
 * 2.移动到该场景(840,1450)触发交谈，再移动到(620,820)触发交谈后，会与祝融、祝霙、祝彪、祝璇、南中盾兵x6进行战斗(需撑过三回合)。
 * 3.战斗结束后回到(840,1450)触发交谈，再移动到(620,820)触发交谈，会与祝融、祝霙、祝彪、祝璇、南中盾兵x6进行战斗(需撑过五回合)。
 * 4.战斗结束后回到(840,1450)触发交谈，再移动到(620,820)触发交谈，会与祝融、祝霙、祝彪、祝璇、南中盾兵x6进行战斗(需撑过七回合)。
 * 5.战斗结束后移动到(2050,850)触发交谈，会与愤怒的祝融、祝彪、祝璇、南中盾兵x7进行战斗。
 * 6.战斗胜利后移动到(1900,1450)触发交谈，再移动到(950,600)触发交谈并答应协助(木兽钢焰加入队伍)。
 * 7.将木兽钢焰设为出战并移动到(1900,1450)触发交谈后，会与木鹿大王、噬血毒蛇x2、银坑战象x2、南蛮猛虎x2、邪铠猛狮x2进行战斗。
 * 8.战斗胜利后与蜀兵交谈，再前往银坑山触发交谈，会与祝融、孟获进行战斗。
 * 9.战斗胜利后与诸葛亮交谈，即可完成任务。
 * 任务奖品:经验值若干(0.5%)、[随机取得]蜀谶言(知+34、攻-3,Lv117)、三昧真火扇(知+29、敏+2,Lv117)、升霸弓(知+29、敏+4,Lv117)
 * 备注:
 * <p/>
 * Date: 2017/5/21
 * Time: 8:53
 *
 * @author Tian.Dong
 */
public class T11_liuqinmenghuo {
}
