package tk.gbl.core.script.work.shimao;

/**
 * 任务名称:七擒孟获
 * 地区:需完成“桃花渡的水、土安与藤甲、六擒孟获”的任务
 * 任务条件:南中、棕榈雨林
 * 流程:
 * 1.前往棕榈雨林移动到左下(900,1430)触发交谈后，答应协助。
 * 2.前往盘蛇谷小径2触发交谈后，返回棕榈雨林左下触发交谈并答应协助。
 * 3.前往桃花渡小岛(950,750)触发交谈后，会与奚泥、土安、藤甲军x8进行战斗(需撑过三回合)。
 * 4.战斗结束后回桃花渡与魏延交谈，再返回桃花渡小岛触发交谈，会与奚泥、土安、藤甲军x8进行战斗(需撑过七回合)。
 * 5.战斗结束后回桃花渡与魏延交谈，返回棕榈雨林左下触发交谈并答应协助(取得【地雷引信】)。
 * 6.前往盘蛇谷小径2触发交谈后，再经由塔郎甸返回盘蛇谷小径1触发交谈，会与兀突骨、奚泥、土安、藤甲将x7进行战斗(需撑过七回合)。
 * 7.战斗结束后前往盘蛇谷小径2触发交谈，答应诸葛亮的请求(获得“藤甲军甲”)。
 * 8.使用“藤甲军甲”后进入乌戈国与孟获交谈，再到塔郎甸触发交谈，会与孟获、孟优、南中骑兵x8(增援:愤怒的孟获、愤怒的孟优、南中骑兵x8)进行战斗。
 * 9.战斗胜利后返回棕榈雨林左下触发交谈，随机取得【孟家令】或【祝家令】。
 * 10.取得孟家令至银坑山宫殿与孟获交谈，或取得祝家令到银坑山闺房与祝融交谈即可完成任务。
 * <p/>
 * 任务奖品:孟家令-孟芸洞主(心系武力型武将)、祝家令-祝宁月(心系知力型武将)
 * 备注:
 * <p/>
 * Date: 2017/5/21
 * Time: 8:55
 *
 * @author Tian.Dong
 */
public class T12_qiqinmenghuo {
}
