package tk.gbl.core.script.work.shimao;

/**
 * 任务名称:大战三洞元帅
 * 地区:南中、永昌城
 * 任务条件:需完成“诸葛亮点兵征南蛮”的任务
 * 流程:
 * 1.进入永昌城触发与诸葛亮交谈，答应协助。
 * 2.进入永昌寨(永昌城右下)左上与诸葛亮交谈2次，前往(X:442 Y:835)触发与赵云交谈后，前往永昌树 林(左下)抓南中兵。
 * 3.抓玩南中兵回永昌寨触发交谈，前往金环三结大寨(X:1396 Y:403)触发交谈在往中上(X:871 Y:683) 触发，与进行战斗*10。
 * 4.前往左上(X:502 Y:515)触发与南蛮精兵*6进行战斗，
 * 在前往右中(X:1313 Y:803)触发与南蛮精兵*8 进行战斗，在往中上(X:871 Y:683)触发与进行战斗*10。
 * 5.战斗完后前往左下触发与交谈会有2个选项。
 * A:我帮助你去攻打董茶那吧!
 * B:我想帮助赵将军攻打阿哙喃!
 * (请任选一个,我选阿哙喃)
 * 6.前往阿哙喃寨(永昌树林左上)，一进入阿哙喃寨就会触发交谈，然后前往(X:590 Y:917)与南蛮精兵 *10进行战斗。
 * 7.战斗结束后回永昌寨与诸葛亮交谈，即可完成任务。
 * <p/>
 * 任务奖品:经验值(0.3%)、[随机取得]福星*5、醍醐丹*20
 * <p/>
 * Date: 2017/5/21
 * Time: 8:49
 *
 * @author Tian.Dong
 */
public class T4_dazhansandongyuanshuai {
}
