package tk.gbl.core.script.work.shimao;

/**
 * 任务名称:初擒孟获
 * 地区:南中、永昌寨
 * 任务条件:需完成“大战三洞元帅”的任务
 * 流程:
 * 1.与诸葛亮交谈答应协助，前往永昌山道(X:3122 Y:295)触发交谈，与忙牙长进行战斗(需撑3回合不得 打死)。
 * 2.往西南方(X:1815 Y:877)触发，与雕蛮酋长*2、狼蛮酋长*2、面蛮酋长*2、豚蛮酋长*2进行战斗(需 撑3回合不得打死)。
 * 3.战斗完后前往(X:642 Y:915)触发交谈，寻找孟获限时15分钟，需打4场。
 * A、X:1181 Y:522，与豚蛮酋长*1、豚蛮兵*9进行战斗。
 * B、X:1762 Y:755，与雕蛮酋长*1、雕蛮卒*9进行战斗。
 * C、X:2639 Y:951，与面蛮酋长*1、面蛮卒*9进行战斗。
 * D、X:2998 Y:594，与狼蛮酋长*1、狼蛮卒*9进行战斗。
 * 4.前往右上场景永昌小径(X:291 Y:348)触发，与忙牙长、*1南蛮精兵*8进行战斗。
 * 5.战斗完后，前往锦带山在桥边(X:697 Y:777)触发交谈，与孟获、忙牙长*1南蛮精兵*8进行战斗。
 * 6.战斗完后回永昌寨与诸葛亮交谈，即可完成任务。
 * <p/>
 * 任务奖品:经验值(0.3%)、卢龙冰晶(心+7)
 * 备注:
 * <p/>
 * <p/>
 * Date: 2017/5/21
 * Time: 8:50
 *
 * @author Tian.Dong
 */
public class T5_chuqinmenghuo {
}
