package tk.gbl.core.script.work.shimao;

/**
 * 任务名称:再擒孟获
 * 地区:南中、永昌寨
 * 任务条件:需完成“初擒孟获”的任务
 * 流程:
 * 1.到永昌寨与诸葛亮交谈后，由永昌山道右下方进入泸水沙口(2800,2700)触发交谈并答应协助。
 * 2.返回永昌寨与诸葛亮交谈完再到泸水沙口与吕凯交谈后，再返回永昌寨与诸葛亮交谈并答应协助。
 * 3.前往泸水沙口(2800,2700)触发后与马岱交谈，由右下方通过泸水到大地图，再进入夹山峪小径2中间触发交谈并答应协助。
 * 4.前往夹山峪小径中间触发交谈后，会与豚蛮卒x3、重粮车x2、巨牛蛮卒x3、豹蛮卒x2进行战斗。
 * 5.战斗胜利后返回夹山峪小径2中间触发交谈，再前往夹山峪小径查看情况。
 * 6.移动到中间(370,600)触发交谈后，会与董茶那、南蛮精兵x9进行战斗。
 * 7.战斗胜利后返回永昌寨与诸葛亮交谈，再前往泸水沙口(2800,2700)触发交谈，即可完成任务。
 * 任务奖品:经验值若干(1%)
 * 备注:
 * <p/>
 * <p/>
 * Date: 2017/5/21
 * Time: 8:50
 *
 * @author Tian.Dong
 */
public class T6_zaiqinmenghuo {
}
