package tk.gbl.core.script.work.shimao;

/**
 * 任务名称:三擒孟获
 * 地区:南中、永昌寨
 * 任务条件:需完成“再擒孟获”的任务
 * 流程:
 * 1.到永昌寨与诸葛亮交谈2次后，答应前往泸水沙口搜集20株【莨菪(不可交易)】。
 * 2.搜集齐全返回永昌寨与诸葛亮交谈，将莨菪分给马谡与吕凯后再与诸葛亮交谈3次并答应协助(取得【擒孟获之计】)。
 * 3.前往泸水沙口右下方桥上与马岱交谈4次后取得“伪装箱”，答应协助。
 * 4.使用伪装箱后前往夹山峪战场(圣灵区)右上木栏触发交谈，再前往永昌山道右下方桥上触发交谈。
 * 5.前往永昌寨与孟优交谈2次后，酒醉的孟优加入队伍(需出战)。
 * 6.移动到(1150,1050)触发交谈后，会与王平、马忠、张嶷、蜀兵x5进行战斗(需撑过五回合)。
 * 7.战斗结束后前往永昌山道右下方桥上触发交谈，会与吕凯、魏延、费祎、蒋琬、蜀兵x5进行战斗(需撑过七回合)。
 * 8.战斗结束后前往泸水沙口右下方桥上触发交谈，会与赵云、张苞、关索、关兴、蜀兵x6进行战斗(需撑过七回合)。
 * 9.战斗结束后前往泸水的沙洲上触发交谈(酒醉的孟优离开队伍)，会与孟获、孟优、南中力士x8(增援：豚蛮酋长x2、雕蛮酋长x2、狼蛮酋长x2、豹蛮酋长x2)进行战斗。
 * 10.战斗胜利后到永昌寨与诸葛亮交谈2次，任一选择诸葛亮身后的宝箱，即可完成任务。
 * 任务奖品:[随机取得]外族宝石、施毒纹章、幻影羽毛、全治疗符x40
 * 备注:
 * <p/>
 * Date: 2017/5/21
 * Time: 8:50
 *
 * @author Tian.Dong
 */
public class T7_sanqinmenghuo {
}
