package tk.gbl.core.script.work.shimao;

/**
 * 任务名称:四擒孟获
 * 地区:南中、竹山
 * 任务条件:需完成“三擒孟获”的任务
 * 流程:
 * 1.前往竹山(左进场景)与诸葛亮交谈后，移动到木栏中央触发交谈。
 * 2.返回原处与诸葛亮交谈后，答应搜集1把“锄头”、20根“过鲁枝(木族人)”、10片“秋红叶(钜鹿大 祭坛)”、10片“深菊叶(碣石山)”。
 * 3.搜集齐全后返回与诸葛亮交谈，答应协助。
 * 4.前往竹山(右进场景750,1550)触发交谈后，答应协助。
 * 5.前往夹山峪战场2(1400,920)触发交谈后，会与孟获、孟优、南中盾兵x8进行战斗。
 * 6.战斗胜利后前往夹山峪战场3(1800,850)触发交谈后，会与孟获、孟优、南中盾兵x6进行战斗。
 * 7.战斗胜利后前往夹山峪小径2(680,360)触发交谈后，会与孟获、孟优、南中盾兵x3进行战斗。
 * 8.战斗胜利后前往竹山(右进场景750,1550)触发交谈后，答应协助。
 * 9.前往竹山(左进场景)与诸葛亮交谈后，即可完成任务。
 * 任务奖品:经验值若干(0.5%)、[随机取得]华灵芝x30(不可交易)、火灵锦囊(不可交易)
 * 备注:
 * <p/>
 * <p/>
 * Date: 2017/5/21
 * Time: 8:51
 *
 * @author Tian.Dong
 */
public class T8_siqinmenghuo {
}
