package tk.gbl.core.script.work.shimao;

/**
 * 任务名称:薤叶芸香
 * 地区:南中.马家寨
 * 任务条件:需完成“四擒孟获”的任务
 * 流程:
 * 1.前往马家寨蜀兵(箭楼左方)交谈后，答应协助。
 * 2.前往马将军庙触发交谈后，答应协助。
 * 3.前往万安溪隐居茅庐与万安隐者交谈后，获得10个薤叶芸香(不可交易)。
 * 4.前往马家树林2与王平交谈后，(进入限时模式)在该场景与周围的蜀兵交谈(请多交谈几次)，10分钟 内完成帮蜀兵解毒。
 * 5.折回马家树林与吕凯交谈后，(进入限时模式)在该场景与周围的蜀兵交谈(请多交谈几次)，10分钟内 完成帮蜀兵解毒。
 * 6.前往马家寨进入马家大帐与诸葛亮交谈后，即可完成任务。
 * 任务奖品:白色经验丹(经验值+100,不可交易)、真福星x30、蜀山凉茶x30、巴蜀粽x50、福神x50、特级药
 * 备注:
 * <p/>
 * Date: 2017/5/21
 * Time: 8:53
 *
 * @author Tian.Dong
 */
public class T9_feiyeyunxiang {
}
