package tk.gbl.core.script.work.shimao;

/**
 * 任务名称:吕蒙计图荆州
 * 地区:江东、柴桑寨
 * 任务条件:LV25
 * 流程:
 * 1.前往江东柴桑寨(飞棹兵场景)与孙权交谈，答应协助
 * 2.前往荆北江东吴寨(凌統場景1650,900)与吕蒙与交谈，答应协助
 * 3.回柴桑塞与孙权交谈后返回东吴塞与吕蒙交谈
 * 4.回到柴桑寨与孙权交谈，会有3个选项:
 * 　A.製作假扮商人的衣服(需要江南绸布*20) 「江南綢布(以野蠶丝布合成机率教高)」
 * 　B.建造可以藏兵的船筏【需要西川柚木*20(轩辕山顶-辕山子)(兗州穎川树林-镇远兵)】破石弓 35 破石弓 攻+6 敏+2 $1200 准南─壽春城
 * 　C.训练攻打荆州的士兵(需要把江东兵练到60级) (小兵要闪人的不推荐)
 * 5.选择其中一项,完成所选项即可完成任务。
 * 任务奖品:经验值若干、[随机获得]醍醐丹x20、晞星羽毛(+10?)
 * <p/>
 * Date: 2017/4/26
 * Time: 15:39
 *
 * @author Tian.Dong
 */
public class U4_lvmengjitujingzhouAction {
}
