package tk.gbl.core.script.work.activity;

import tk.gbl.core.GameClient;
import tk.gbl.core.ScriptAction;

import java.io.IOException;

/**
 * Date: 2017/6/2
 * Time: 18:59
 *
 * @author Tian.Dong
 */
public class ErQiaoAction extends ScriptAction {
    @Override
    public void doAction(GameClient gameClient) throws IOException {
        String steps =
                "塔战 - 1层1=12922=0=1490,490=1=3==0=False=0=5=0\n" +
                        "塔战 - 1层2=12922=0=1490,490=1=4==0=False=0=5=0\n" +
                        "塔战 - 2层1=12923=0=930,630=1=3==0=False=0=5=0\n" +
                        "塔战 - 2层宝箱=12923=1=570,340=0=0==0=False=0=5=0\n" +
                        "塔战 - 3层1=12924=0=170,1610=1=3==0=False=0=5=0\n" +
                        "塔战 - 3层2=12924=0=170,1610=1=4==0=False=0=5=0\n" +
                        "塔战 - 3层3=12924=0=170,1610=1=5==0=False=0=5=0\n" +
                        "塔战 - 3层宝箱=12924=1=770,260=0=0==0=False=0=5=0\n" +
                        "塔战 - 4层1=12925=0=170,1610=1=3==0=False=0=5=0\n" +
                        "塔战 - 4层2=12925=0=170,1610=1=4==0=False=0=5=0\n" +
                        "塔战 - 4层3=12925=0=170,1610=1=5==0=False=0=5=0\n" +
                        "塔战 - 4层宝箱=12925=1=770,260=0=0==0=False=0=5=0\n" +
                        "塔战 - 5层1=12926=0=170,1610=1=3==0=False=0=5=0\n" +
                        "塔战 - 5层2=12926=0=170,1610=1=4==0=False=0=5=0\n" +
                        "塔战 - 5层3=12926=0=170,1610=1=5==0=False=0=5=0\n" +
                        "塔战 - 5层宝箱=12926=1=770,260=0=0==0=False=0=5=0\n" +
                        "塔战 - 6层1=12927=0=170,1610=1=3==0=False=0=5=0\n" +
                        "塔战 - 6层2=12927=0=170,1610=1=4==0=False=0=5=0\n" +
                        "塔战 - 6层3=12927=0=170,1610=1=5==0=False=0=5=0\n" +
                        "塔战 - 6层宝箱=12927=1=770,260=0=0==0=False=0=5=0\n" +
                        "塔战 - 7层1=12928=0=170,1610=1=3==0=False=0=5=0\n" +
                        "塔战 - 7层2=12928=0=170,1610=1=4==0=False=0=5=0\n" +
                        "塔战 - 7层3=12928=0=170,1610=1=5==0=False=0=5=0\n" +
                        "塔战 - 7层宝箱=12928=1=770,260=0=0==0=False=0=5=0\n" +
                        "塔战 - 8层1=12929=0=170,1610=1=3==0=False=0=5=0\n" +
                        "塔战 - 8层2=12929=0=170,1610=1=4==0=False=0=5=0\n" +
                        "塔战 - 8层3=12929=0=170,1610=1=5==0=False=0=5=0\n" +
                        "塔战 - 8层宝箱=12929=1=770,260=0=0==0=False=0=5=0\n" +
                        "塔战 - 9层1=12930=0=170,1610=1=4==0=False=0=5=0\n" +
                        "塔战 - 9层2=12930=0=170,1610=1=5==0=False=0=5=0\n" +
                        "塔战 - 9层3=12930=0=170,1610=1=6==0=False=0=5=0\n" +
                        "塔战 - 9层宝箱=12930=1=770,260=0=0==0=False=0=5=0\n" +
                "塔战 - 进10层=12930=0=770,260=1=3==0=False=0=5=0\n" +
                "塔战 - 10层1=12931=0=170,1610=1=3==0=False=0=5=0\n" +
                "塔战 - 10层2=12931=0=170,1610=1=4==0=False=0=5=0\n" +
                "塔战 - 10层3=12931=0=170,1610=1=5==0=False=0=5=0\n" +
                "塔战 - 10层宝箱=12931=1=770,260=0=0==0=False=0=5=0";

        for (String step : steps.split("\n")) {
            gameClient.doDoDoScriptAction(step);
            try {
                Thread.sleep(1000);
            } catch (InterruptedException e) {
                e.printStackTrace();
            }
        }
    }
}
