package tk.gbl.constant;

/**
 * Date: 2017/3/27
 * Time: 14:50
 *
 * @author Tian.Dong
 */
public enum ResponseProtocolConstant {
    u0101(0x0101),
    chat(0x0202),
    chatMi(0x0203),
    //    u030E(0x030E),
//    u035E(0x035E),//登录时人昵称 地图id
//    u035D(0x035D),//登录时人昵称 地图id
//    u03C5(0x03C5),
    u03(0x03),//人昵称 地图id
    u0C(0x0C),//F4 44 0D 00 0C 76 A2 00 00 E9 4E 9A 01 9A 01 02 00
    u048F(0x048F),
    u0500(0x0500),
    u0504(0x0504),
    u0503(0x0503),//登录时 人的血量 蓝量
    u0602(0x0602),//
    u0801(0x0801),//学会技能
    u0802(0x0802),
    u0B00(0x0B00),//?
    u0B01(0x0B01),//战斗结束?
    joinTeamRequest(0x0D01),//有人申请入队
    u0D04(0x0D04),//退队!
    joinTeamSuccess(0x0D05),//申请入队成功
    u0D07(0x0D07),//设置军师成功
    u0D08(0x0D08),//
    u0D0B(0x0D0B),//

    u0F01(0x0F01),//得到宠物
    u0F02(0x0F02),//失去宠物
    u0F08(0x0F08),//所有宠物信息

    u3401(0x3401),//回合开始???
    u3503(0x3503),
    u3505(0x3505),
    u0BFA(0x0BFA),//人的位置 血量
    u0B0A(0x0B0A),
    u0B05(0x0B05),//怪 宠物的位置血量

    u1001(0x1001),//北斗星君的问题

    u1A01(0x1A01),//得到金钱
    u1A02(0x1A02),//失去金钱
    u1A04(0x1A04),//金币数量

    u1301(0x1301),//出战宠物
    u1302(0x1302),//武将休息
    u1304(0x1304),//出战宠物

    u1401(0x1401),//对话框
    u1410(0x1410),//
    u1411(0x1411),//
    u140B(0x140B),//
    u140C(0x140C),//
    u140D(0x140D),//
    u1603(0x1603),//
    u1407(0x1407),
    u1408(0x1408),
    u1409(0x1409),//
    u1421(0x1421),
    move(0x1422),
    moveMapEnter(0x0C),

    u1E01(0x1E01),//钱庄物品
    pickUp(0x1702),//有人在捡东西
    throwAway(0x1703),//有人在扔东西 出现物品
    storeBag(0x1E01),
    bag(0x1705),
    u1704(0x1704),//场景里的物品
    u1706(0x1706),//得到物品
    u1707(0x1707),//和NPC对话失去物品
    u1708(0x1708),//别人交易物品的显示
    u1709(0x1709),//失去东西
    u1710(0x1710),//卸下装备
    u1711(0x1711),//装备物品
    u1716(0x1716),//宠物卸下物品
    u1717(0x1717),//宠物装备物品
    u171B(0x171B),//装备耗损
    u171C(0x171C),//武将装备耗损F4 44 05 00 17 1C 01 02 29
    u170A(0x170A),//拆分物品
    u170B(0x170B),// F4 44 0C 00 17 0B 45 4D 00 00 00 00 00 00 00 00
    u178D(0x178D),//得到物品

    uC706(0xC706),//服务器说的话
    u1739(0x1739),//服务器说的话
    tradeRequest(0x1901),//有人发起交易物品
    tradeDone(0x1902),//交易完成或取消
    tradeConfirm(0x1903),//别人交易确认的物品
    tradePetRequest(0x190A),//有人发起交易武将

    u1805(0x1805),
    u1808(0x1808),
    u3201(0x3201),//怪物受到伤害
    u4E01(0x4E01),;

    private int id;

    ResponseProtocolConstant(int id) {
        this.id = id;
    }

    public int getId() {
        return id;
    }

    public void setId(int id) {
        this.id = id;
    }
}
