package tk.gbl.core.script.work.lingzhu;

/**
 * 任务名称:文姬归汉
 * 地区:冀州、邺城
 * 任务条件:不详
 * 流程:
 * 1.到邺城铜雀台与徐晃交谈，答应协助，得单于金印。
 * 2.到并州南匈奴部落与左贤王交谈。
 * 3.再到左边的军帐内，与呼厨泉交谈，会与去卑、左贤王、呼厨泉、于夫罗、匈奴戟手x6进入战斗。
 * 4.胜利后，在到旁边的军帐内与蔡文姬交谈。
 * 5.回去与曹操交谈，答应搜集符黄纸x3。
 * 6.搜集完后与曹操交谈即可完成任务。
 * <p/>
 * 任务奖品:御赐纹章(HP+40、Lv.15)、仙女图(忠+3)、光武纹章
 * 备注:
 * <p/>
 * <p/>
 * 任务名称:慧眼识英雄
 * 地区:冀州、邺城
 * 任务条件:需完成文姬归汉的任务
 * 流程:
 * 1.到冀州邺城的铜雀台与徐晃交谈，得『许褚娃娃x1』。
 * 2.变身成为许褚，再与徐晃交谈。
 * 3.再前往邺城巷道的馆绎与匈奴使者交谈。
 * 4.再回去与徐晃交谈即可完成任务。
 * <p/>
 * 任务奖品:狂炎斩纹章
 * 备注:
 * <p/>
 * <p/>
 * 任务名称:蔡文姬的归宿
 * 地区:冀州、邺城
 * 任务条件:需完成文姬归汉、慧眼识英雄的任务
 * 流程:
 * 1.到冀州邺城的铜雀台与徐晃交谈，答应协助。
 * 2.到塔顶与蔡文姬交谈。
 * 3.在回去与徐晃交谈，答应协助。
 * 4.前往平原城与刀斧手交谈，会与刀斧手x6进入战斗。
 * 5.胜利后进入监狱与满宠交谈，会与满宠、鲜于辅、高柔、枭甲士x6进入战斗。
 * 6.胜利后即可完成任务。
 * <p/>
 * 任务奖品:风灵珠
 * <p/>
 * <p/>
 * Date: 2017/5/19
 * Time: 15:05
 *
 * @author Tian.Dong
 */
public class FenglingzhuAction {
}
