package tk.gbl.core.script.work.baoji;

import tk.gbl.core.GameClient;
import tk.gbl.core.ScriptAction;

import java.io.IOException;

/**
 * 荊楚酒6级
 * 风干羊肉3级
 * <p/>
 * 答應收集「江鱷刀(LV15)」與「百鍛戟(LV15)」各一
 * 答应收集「荊楚酒(江陵兵)」、「风乾羊肉(民兵)」各20份
 * <p/>
 * 任务名称:陸口失控
 * 地区:淮南、濡須寨
 * 任务条件:LV25
 * 流程:
 * 1.進入濡須寨大帳內與朱然交談後，答應協助。
 * 2.前往柴桑帳與魯肅交談後，答應協助。
 * 3.前往柴桑寨(糧船軍場景左下)與芮良交談後，再返回柴桑帳與魯肅交談，答應收集「江鱷刀(LV15)」與「百鍛戟(LV15)」各一。
 * 4.收集齊全後再與魯肅交談，前往陸口亭(荊北臨江亭對面)。
 * 5.接近魯肅觸發劇情後，依序回答：
 * 諸葛軍師、結為同盟、長阪、桃園結義
 * 6.回答完後進行一段劇情，前往陸口碼頭(950,610)觸發劇情後，即可完成任務。
 * Date: 2017/6/6
 * Time: 14:02
 *
 * @author Tian.Dong
 */
public class GanxingbaAction extends ScriptAction {
    @Override
    public void doAction(GameClient gameClient) throws IOException {
        if(gameClient.getItemCount(29269) < 5) {
            String steps2 = "拾料1=15457=0=1182,2155=2=0==29269=False=0=0=0\n" +
                    "拾料2=15460=0=440,395=2=0==29269=False=0=0=0\n" +
                    "拾料3=15452=0=442,915=2=0==29269=False=0=0=0\n" +
                    "拾料4=15462=0=182,635=2=0==29269=False=0=0=0";
            for (String step : steps2.split("\n")) {
                gameClient.doDoDoScriptAction(step);
            }
        }

        String steps =
                "1陆口失控-朱然=15460=9=490,580=0=0==0\n" +
                        "1陆口失控-鲁肃=18817=1=390,380=0=0==0\n" +
                        "1陆口失控-芮良=18820=3=530,300=0=0==0\n" +
                        "1陆口失控-鲁肃2=18817=1=390,380=0=0==0\n" +
                        "1陆口失控-鲁肃3=18817=1=390,380=0=0==0\n" +
                        "1陆口失控-陆口鲁肃=21451=0=650,260=1=2=4,3,2,1=0\n" +
                        "1陆口失控-陆口码头=21452=0=950,610=1=4==0\n" +
                        "2计赚零陵-孙权=21872=15=2290,380=0=0==0\n" +
                        "2计赚零陵-紧急军令=21452=0=1000,590=1=5==0\n" +
                        "2计赚零陵-吕蒙=23803=5=330,1100=0=0==0\n" +
                        "2计赚零陵-军帐前=23803=0=2019,470=1=4==0\n" +
                        "2计赚零陵-吕蒙加入=23801=0=175,502=1=3==0\n" +
                        "2计赚零陵-邓玄之1=23003=5=230,740=0=0==0\n" +
                        "2计赚零陵-邓玄之2=23003=5=230,740=0=0==0\n" +
                        "2计赚零陵-零陵小兵=23011=0=370,820=1=5==0\n" +
                        "3皖城大战-孙权=21452=11=290,220=0=0==0\n" +
                        "3皖城大战-凌统=18511=10=1170,2280=0=0==0\n" +
                        "3皖城大战-皖城孙权=15492=1=1470,1720=0=0==0\n" +
                        "3皖城大战-桥1=15492=0=1083,2246=1=3==0\n" +
                        "3皖城大战-桥2=15492=0=505,1831=1=4==0\n" +
                        "3皖城大战-桥3=15492=0=2058,835=1=5==0\n" +
                        "3皖城大战-桥4=15492=0=730,563=1=6==0\n" +
                        "3皖城大战-大帐孙权=15494=1=890,420=0=0==0";

        for (String step : steps.split("\n")) {
            gameClient.doDoDoScriptAction(step);
        }
    }
}
