/**
 *  任务名称:陸口失控
 地区:淮南、濡須寨
 任务条件:LV25
 流程:
 1.進入濡須寨大帳內與朱然交談後，答應協助。
 2.前往柴桑帳與魯肅交談後，答應協助。
 3.前往柴桑寨(糧船軍場景左下)與芮良交談後，再返回柴桑帳與魯肅交談，答應收集「江鱷刀(LV15)」與「百鍛戟(LV15)」各一。
 4.收集齊全後再與魯肅交談，前往陸口亭(荊北臨江亭對面)。
 5.接近魯肅觸發劇情後，依序回答：
 諸葛軍師、結為同盟、長阪、桃園結義
 6.回答完後進行一段劇情，前往陸口碼頭(950,610)觸發劇情後，即可完成任務。

 任务奖品:經驗值若干(0.5%)
 备注:
 任务名称:計賺零陵
 地区:荊北、江夏寨
 任务条件:須完成「陸口失控」的任務
 流程:
 1.前往江夏寨(擲標隊場景)右上與孫權交談後，答應協助。
 2.前往陸口碼頭(1000,590後，往左上移動)觸發交談後，答應協助(取得【緊急軍令】)。
 3.前往巴丘寨2與呂蒙交談後，往右上接近軍帳觸發交談，答應前往。
 4.至巴丘寨門(鮮于丹左邊))觸發交談後，答應協助並前往長沙(呂蒙加入隊伍)。
 5.至長沙街道與鄧玄之交談後，再前往零陵(小兵下方)觸發交談

 任务奖品:經驗值若干(0.8%)、深山野蔘x20
 备注:
 任务名称:皖城大戰
 地区:荊北、陸口碼頭
 任务条件:須完成「計賺零陵」的任務
 流程:
 1.於陸口碼頭上方與孫權交談後，答應協助。
 2.前往江東餘杭山洞與凌統交談後，會與洪明、山越兵x5進行戰鬥。
 3.勝利後前往皖城場景(由皖口渡口進入)與孫權交談，再往下過橋時會與夏侯存、鐵冑兵x5進行戰鬥。
 4.勝利後往左上走觸發交談，會與夏侯德、牙門將x5進行戰鬥。
 5.勝利後往右上走觸發交談，會與夏侯尚、左偏將x5進行戰鬥。
 6.勝利後往左上移動觸發交談，會與皖城守兵、曹休、朱光、羽林槍兵x3進行戰鬥。
 7.勝利後前往第二場景帳中與孫權交談，會陸續與甘寧、凌統進行戰鬥(皆須一回合內完成)。
 8.勝利後即可完成任務。

 任务奖品:經驗值若干(0.5%)
 备注:
 任务名称:孤有甘兴霸
 地区:淮南、濡須寨
 任务条件:需完成「皖城大战」的任務
 流程:
 1.到濡須寨勇门兵场景下方与孫权交谈后，再交谈一次后答应协助。
 2.进入濡須坞右上方的钟乳石洞內(2250,2250)触发交谈后，會与張辽、典兵曹x9进行战斗。
 3.战斗胜利后返回与孫权交谈，再前往官帐与甘宁交谈，答应收集「荊楚酒(江陵兵)」、「风乾羊肉(民兵)」各20份。
 4.取得道具后返回官帐与甘宁交谈，答应收集5根【白鵝翎】(濡須坞帐外、甘宁帐外面、濡須大帐內、濡須曹营)。
 5.取得道具后返回官帐甘宁交谈，答应协助。
 6.前往濡須曹营(濡須塢口右上方)触发交谈后，依序移动到下列地点：
 移动動到(630,500)，會与典滿、郭淮、上軍將x5进行战斗。
 结束后移动到(1100,350)，会与郝昭、上軍將x5进行战斗。
 结束后移动到(850,150)，会与公孫集、上軍將x6进行战斗。
 结束后移动到(1200,700)，会与上軍將x10进行战斗。
 结束后移动到(900,850)，会与曹彰、乐進、上軍將x6进行战斗。
 结束后移动到(800,550)，会与程昱、荀彧、上軍將x6进行战斗。
 结束后移动到(400,400)，会与夏侯淳、上軍將x6(增援：上軍將x1)进行战斗。
 结束后移动到(50,500)，会与王双、上軍將x8(增援：上軍將x2)进行战斗。
 结束后移动到(350,850)，会与崔琰、上軍將x5进行战斗。
 结束后移动到(250,200)，会与許褚、徐晃、上軍將x8(增援：曹操、上軍將x2)进行战斗。
 7.战斗結结束后移动到转送点附近触发交谈后，再返回与孫劝交谈即可完成任務。

 任务奖品:经验值若干(0.8%)、[随机取得]甘兴霸(攻+31、敏+4,LV50)、醍醐丹x15
 备注:
 任务名称:孙权折兵濡須口
 地区:淮南、濡須寨
 任务条件:需完成「孤有甘兴霸」的任務
 流程:
 1.完成孤有甘兴霸任务后会继续与孙权交谈，答应协助。
 2.前往濡須樹林2(威武兵場景1300,700)触发交谈后，会与曹休、張辽、典兵曹x8进行战斗。
 3.战斗胜利后前往濡須寨(1050,2900)触发交谈后，答应协助。
 4.前往濡須濘沼(威武兵場景右下)触发交谈后，往右移动(550,200)触发交谈后，答应协助。
 5.移动到(2200,1150)触发交谈后，负伤的孙权加入队伍(须出战)。
 6.依序移动到下列地点：
 移动到(2150,850)，会与張辽、上軍將x4进行战斗。
 结束后移动到(1600,700)，会与徐晃、上军將x4进行战斗。
 结束后移动到(1200,650)，会与許褚、上军將x4进行战斗。
 7.战斗胜利后移动到(500,250)2次，答应协助。
 8.移动到(1800,1500)后，会与張辽、徐晃、許褚、上军將x7进行战斗。
 9.战斗胜利后移动到(500,250)触发交谈后，会与曹操、矩阵军x9进行战斗。
 10.战斗胜利后，即可完成任務。
 任务奖品:[随机取得]白翎羽甲(攻+29、敏+3,LV50)、回意錦囊x2
 备注:





 任务名称-大商人杜鲁尼
 触发条件-LV25
 触发地点-丝路、疏勒城 29001
 流程-
 1.进入疏勒客栈与杜鲁尼交谈后，答应协助。
 2.至于闐矿坑收集10个「尾指金片」后，返回与其交谈再答应协助。
 3.再收集5个「玄光水晶」、1个「鸡血石」后，返回与其交谈并付200金。
 4.前往疏勒城门触发交谈后，即可完成任务。
 ->获得物品:杜鲁尼的短刀


 任务名称-强渡玉门关
 触发条件-须完成「大商人杜鲁尼」的任务
 触发地点-西域、伊吾卢城28001
 流程-
 1.前往伊吾卢城门与杜鲁尼交谈后，答应协助。
 2.进入城内与钱庄前的屯田兵交谈后，给他100金获得情报。
 3.前往伊无卢广场(屯田兵左方)小屋内，与老学究交谈给他【杜鲁尼的短刀】后，答应协助。
 4.至伊吾卢绿洲打怪收集2个「西域香瓜」后返回与老学究交谈，获得【通关证明】及4个西域香瓜。
 5.返回伊吾卢城门与杜鲁尼交谈后，前往玉门关触发交谈，会与守关士卒x6进行战斗(需三回合内完成)。
 6.战斗胜利后，即可完成任务。
 ->获得物品:西域香瓜x4、杜鲁尼的头盔


 任务名称-杜鲁尼的报恩　
 触发条件-需完成[强渡玉门关]的任务
 触发地点-凉州、居沿砦
 流程-
 1.跟杜鲁尼对话答应收集英雄胆5个(交州-朱崖竹林-95火鉤刀將)、天崩地裂符15张、杜鲁尼的头盔。
 2.在杜鲁尼身边拾取[百斤大铁锤]。
 3.收集齐全后再与杜鲁尼交谈，即可完成任务。
 ->获得物品:神秘假面(攻+7敏+1、LV15、可交易、可合成)
 PS:各系所需要的材料不同
 火系：15个娟红水晶（8级矿），5张烽火燎原符
 地系：5个英雄胆（交州朱崖竹林2-鉤刀将），15张天崩地裂符
 水系：8个 阴河黑石（益州幽暗鬼城可一次拣4个），12个冰封符
 风系：2个风灵珠，18个乱击符

 任务名称-千锤百炼
 触发条件-转生Lv25以上，身上需有「神秘假面」
 触发地点-地狱、油锅
 流程-
 1.与油锅旁边的冥府工匠交谈后，答应协助。
 2.前往仙界瑶池捡拾【醉仙酒】后再到蟠桃神坛与王母娘娘交谈，选择「准备好了」(需单独进入战斗，可参战)。
 3.接著会与王母娘娘、老树仙、仙女x5进行战斗。
 4.战斗胜利取得【仙灵古木】后，返回地狱油锅与冥府工匠交谈，即可完成任务。
 ->任务奖励：经验值若干(2%)


 任务名称-初探秦皇陵
 触发条件-需完成「千锤百炼」的任务
 触发地点-关中、始皇陵
 流程-
 1.前往秦皇陵第三层与盜墓人触发交谈后，答应收集【铲子】与【鑿子】。
 2.前往陈仓寨(即圣灵练功区)右上方取得道具后，返回秦皇陵。
 3.到秦皇陵第三层触发与盜墓人的交谈后，会与机关墓兵x4进行战斗。
 4.战斗胜利后取得【机关墓兵】，前往江陵贫户与黄月英交谈(黄月英加入队伍)。
 5.再前往秦皇陵第三层(盜墓人位置)进入机关时，会与机关墓兵x4进行战斗。 打完按模拟左键
 6.战斗胜利后会进入新场景触发交谈，再进入传点时会与机关墓兵x6进行战斗。
 7.战斗胜利后再前往传点，会与机关墓兵x8进行战斗。
 8.战斗胜利后再前往传点，会与机关墓兵x10进行战斗。
 9.战斗胜利到达陵墓后会触发交谈，再移动到(650,800)会与机关墓兵x5进行战斗。
 10.战斗胜利后再移动到(1100,750)，会与机关墓兵x5进行战斗。
 11.战斗胜利后再移动到(700,700)，会与机关墓兵x6进行战斗。
 12.战斗胜利后，会立即与墓甲将领x3、机关墓兵x7进行战斗。
 13.战斗胜利后取得【千锤钢】，前往地狱油锅与冥府工匠交谈即可完成任务。
 ->任务奖励:经验值若干(3%)
 PS：
 1.盜墓人位置：秦皇陵第三层直下→叉路口右方→叉路口直下→叉路口左方进入下个场景后，往左方移动即可触发
 2.如不慎折回上一场景，进入传点时需再打敗把守的怪物才可进入下个场景
 怪物资料：
 机关墓兵(无)：Lv100、HP3765、特技-万马奔腾、结界、三人树精
 机关墓兵(无)：Lv100、HP3898、特技-地牙、結界、三人树精
 墓甲将领(无)：Lv115、HP4456、特技-会心一击、白虹贯日、三人混乱


 任务名称-重制神盔
 触发条件-需完成「初探秦皇陵」的任务
 触发地点-地狱、油锅
 流程-
 1.到地狱油锅旁找冥府工匠,冥府工匠加入队伍.
 2.前往仙界蟠桃园与火德星君交谈触发战斗(工匠须设置出战).
 3.到单于山洞（辽东19533）1个炉子的地方,触发与女魃战斗(限制三回合),答应铸新头盔.
 4.接著到右上角打女魃,沿路打下去,打完跟冥府工匠交谈后可选攻头或智头,
 选择后完成任务.
 ->获得物品:金胄．征天(攻+29敏+8，暴击率12%)、银冑．冥狱(银冑．冥狱 知+29敏+8，倍敏率12%)


 注：请先准备以下材料
 水系:10个「尾指金片」、5个「玄光水晶」、1个「鸡血石」（于闐矿坑）,8个 阴河黑石（益州幽暗鬼城可一次拣4个），12个冰封符
 火系:10个「尾指金片」、5个「玄光水晶」、1个「鸡血石」（于闐矿坑）,15个娟红水晶（8级矿），5张烽火燎原符
 地系:10个「尾指金片」、5个「玄光水晶」、1个「鸡血石」（于闐矿坑）,5个英雄胆（交州朱崖竹林2-鉤刀将），15张天崩地裂符
 风系:10个「尾指金片」、5个「玄光水晶」、1个「鸡血石」（于闐矿坑）,2个风灵珠，18个乱击符

 * Date: 2017/6/6
 * Time: 13:52
 *
 * @author Tian.Dong
 */
package tk.gbl.core.script.work.baoji;