/**
 * 匡亭之战
 1.进入卢江水寨的最后一个军帐内，与孙策交谈，答应协助他。
 2.前往盱眙水洞迷宫，在洞内会遇见受伤的士兵，与他交谈，会与曹仁、曹洪、刘晔、吕度、朱灵进入战斗，胜利后会立即与夏侯惇、夏侯渊等人进入战斗。
 3.胜利后即可完成任务。
 地区：扬州、卢江水寨
 获得物品：火箭纹章

 濡须收复战
 1.前往寿春城，进入城内与寿春交谈。
 2.在前往寿春街道里面与袁曜交谈。
 3.在回到卢江寨与孙策交谈。
 4.前往濡须寨，通过右上方的濡须钟乳石洞，进入濡须树林，在树林的右上方与卢江兵交谈，会与陆康、陆骏、刘宠、骆俊进入战斗。
 5.胜利后即可完成任务。
 任务条件：须完成匡亭之战任务
 地区：扬州、寿春城
 获得物品：行军帐x5

 神亭岭大战
 1.前往卢江寨的第二个军帐内与周瑜交谈，答应协助他。
 2.前往牛堵树林军帐内与刘繇交谈，会与刘繇、苲融、薛礼、陈横、樊能、于糜进入战斗，胜利后会立即与太史慈、周泰、蒋钦、朱皓、陈武、张英在次进入战斗。
 3.胜利后，出军帐后会再度与太史慈、张英、陈武、蒋钦进入战斗。
 4.胜利后在回去卢江寨找周瑜即可完成任务。
 任务条件：须完成濡须收复战任务
 地区：扬州、卢江水寨
 获得物品：冰剑纹章


 吴郡平定战
 1.进入建业城，见到吴景、孙贲、孙辅，与吴景交谈，答应住他们。前去吴郡平定水贼。
 2.在太湖水洞内，遇见严舆，与他交谈，会与严舆、邹陀、钱铜、王晟等人进入战斗。3.胜利后，再到吴郡树林，遇见严白虎、许贡、三名许贡家客。
 4.战胜后进吴郡大街，与诸葛瑾会交谈，答应协助。5.再到泾县山涯，与陈瑀交谈，会与严白虎、陈瑀、陈牧、祖郎、焦已、万演、凌操。
 6.战胜后即可完成任务。
 任务条件：需完成神亭岭大战
 地区：扬州、建业城
 获得物品：随机获得：熔钢剑、流金刀、黄河戟、铁环刀、熏风枪

 东冶平定战
 1.前去会稽城，在城门口见到虞翻，与他交谈，答应协助。2.前往余姚沼泽，在第二层左方会遇见吕合与秦狼在驻守粮车，与吕合交谈，会与吕合、秦狼、黄龙罗、周勃进入战斗。3.胜利后再到军帐内与全柔交谈，会与周昂、周隅、周昕、全柔进入战斗，胜利后得【王朗令牌】。4.在前往会稽树林，进入后与王朗交谈，会与王朗、严白虎、董袭、贺齐、陈宝、芮良进入战斗。5.得胜后，前往东治村，在右边的小屋内，与王朗交谈，会与商升、何雄、詹强、张雅进入战斗，胜利后得即可完成任务。吕范会出现，请玩家回建业城。任务条件：须完成吴郡平定战
 地区：扬州、建业城
 获得物品：随机获得：演孔图、鬼谷子兵法、伤寒杂病论(知+10、防+1、Lv.40)、紫云长袍、翔鹤长衫


 西塞山大战
 1.在建业官府与孙权交谈，答应前往探查。2.前往庐江水寨，在洞内见到黄猗，与他交谈，会与黄猗、袁、袁曜进入战斗。
 3.胜利后前往柴桑寨第二层，与刘勋交谈，会与刘勋、刘威、刘偕、僮芝进入战斗。4.胜利后前往西塞山，与刘威交谈，会与吕公、张硕、刘偕、刘威、韩晞、黄射、刘盘、刘虎进入战斗。5.胜利后进入山顶，进入后网右上走，与黄祖交谈，会与黄祖、甘宁、蔡瑁、韩晞、黄射、刘盘、刘虎、刘勋、陈生、张虎、王威进入战斗，胜利后即可完成任务。任务条件：须完成东冶平定战
 地区：扬州、建业城
 获得物品：随机获得：背包巴兑换卷、恶魔兑换卷、心巴豆妖兑换卷

 放NPCInfo.ini
 1匡亭之战 - 孙策=15847=2=370,400=0=0=1=0
 1匡亭之战 - 受伤的士兵=15543=3=3950,1600=0=0==0
 2濡须收复战 - 售春兵=15021=9=702,695=0=0==0
 2濡须收复战 - 袁曜=15024=1=1062,515=0=0==0
 2濡须收复战 - 孙策=15847=2=370,400=0=0==0
 2濡须收复战 - 卢江兵=15455=6=1230,560=0=0==0
 3神亭岭大战 - 周瑜=15846=2=190,340=0=0==0
 3神亭岭大战 - 转图=15000=0=1570,1890=1=25==0
 3神亭岭大战 - 刘繇=18802=1=382,415=0=0==0
 3神亭岭大战 - 出帐=18802=0=250,470=1=1==0
 3神亭岭大战 - 触发战斗=18801=0=2730,1310=1=4==0
 3神亭岭大战 - 交任务=15846=2=190,340=0=0==0
 4吴郡平定战 - 吴景=18001=10=1542,555=0=0==0
 4吴郡平定战 - 严舆=18504=1=2162,2215=0=0==0
 4吴郡平定战 - 严白虎=18881=7=322,555=0=0==0
 4吴郡平定战 - 诸葛瑾=18012=4=222,415=0=0==0
 4吴郡平定战 - 陈瑀=18454=1=520,540=0=0==0
 5东冶平定战 - 虞翻=18021=7=742,675=0=0==0
 5东冶平定战 - 吕合=18862=5=440,980=0=0==0
 5东冶平定战 - 全柔=18863=1=522,355=0=0==0
 5东冶平定战 - 王朗1=18891=4=202,1095=0=0==0
 5东冶平定战 - 王朗2=18176=1=470,340=0=0==0
 6西塞山大战 - 孙权=18301=8=582,395=0=0==0
 6西塞山大战 - 黄猗=15842=2=430,290=0=0==0
 6西塞山大战 - 刘勋=18816=8=570,560=0=0==0
 6西塞山大战 - 切换=18816=0=570,560=1=3==0
 6西塞山大战 - 刘威=18422=1=490,780=0=0==0
 6西塞山大战 - 黄祖=18423=9=2522,495=0=0==0


 放NPCBatch.ini
 心豆卷=1匡亭之战 - 孙策,1匡亭之战 - 受伤的士兵,2濡须收复战 - 售春兵,2濡须收复战 - 袁曜,2濡须收复战 - 孙策,2濡须收复战 - 卢江兵,3神亭岭大战 - 周瑜,3神亭岭大战 - 转图,3神亭岭大战 - 刘繇,3神亭岭大战 - 出帐,3神亭岭大战 - 触发战斗,3神亭岭大战 - 交任务,4吴郡平定战 - 吴景,4吴郡平定战 - 严舆,4吴郡平定战 - 严白虎,4吴郡平定战 - 诸葛瑾,4吴郡平定战 - 陈瑀,5东冶平定战 - 虞翻,5东冶平定战 - 吕合,5东冶平定战 - 全柔,5东冶平定战 - 王朗1,5东冶平定战 - 王朗2,6西塞山大战 - 孙权,6西塞山大战 - 黄猗,6西塞山大战 - 刘勋,6西塞山大战 - 切换,6西塞山大战 - 刘威,6西塞山大战 - 黄祖,回钱庄

 * Date: 2017/4/26
 * Time: 15:45
 *
 * @author Tian.Dong
 */
package tk.gbl.core.script.work.badouyao;