/**
 *
 晶透玉杯   21136  江陵大街杂货商卖 21012
 生锈长枪   25435  守关士卒   1362,1295
 残皮甲     25435  守关士卒   242,695
 火把       25414  猛羌将     162,375
 夜光玉杯   25431  南郑大街杂货商卖 25012


 栖凤木     1（江东     彭泽沼泽） 50 鐵胎弓 攻+9 敏+3 $5900 河東 合成  瞿塘峡谷-西蜀水师 ,彭泽沼泽-獾甲士
 山越樟木   1（交州     交织雨林）
 千年栋梁   1（荆北     麦城树林）
 宫廷酒     1（荆北     夷陵寨2 ）

 看守长眼蟹 1（荆北     江夏寨3 ）
 戒空药水   1（荆北     华容道2 ）
 疗伤膏     1（交州     南海树林）
 大水梨     1（益州     关城山洞）

 扬铜屑     5（交州     象山矿坑）
 烙铜屑     5（交州     桂山矿坑）

 锄   头    1（新人村   铁匠铺子）

 太历初     1（凉州       敦皇城）24011
 左  传     1（并州       解良村）20021

 * Date: 2017/6/6
 * Time: 18:29
 *
 * @author Tian.Dong
 */
package tk.gbl.core.script.work.suipian;