package tk.gbl.core.script.work.suipian;

import tk.gbl.core.GameClient;
import tk.gbl.core.ScriptAction;

import java.io.IOException;

/**
 * 任务名称-雒城大战
 * 触发条件-需完成「箭射凤雏」、「义释严顏」的任务
 * 触发地点-益州、西充山洞
 * 流程-
 * 1.进入西充山洞与严顏交谈后，答应协助。
 * 2.前往西充山洞深处与张裔交谈后，再前往绵竹山洞与李邵交谈，再与张飞交谈。
 * 3.前往白水树林与刘备交谈后，会与吴班、吴懿、吴兰、雷铜、成都兵团x4、蜀郡兵团x2(增援：刘贵、张任)进行战斗。
 * 4.战斗结束后，答应收集【生?长枪】、【残皮甲】(皆在该场景取得)，再与刘备交谈。
 * 5.前往雒城(590,590)触发剧情后，前往阴平山洞。
 * 6.与辅匡交谈后，会与费诗、王连、卓膺、刘干、吕义、杜祺、东州兵团x2、三辅兵团x2(增援：张任、张翼、刘贵、成都兵团x2、蜀郡兵团x2)进行战斗。
 * 7.战斗胜利后，再与辅匡交谈后即可完成任务。
 * ->获得物品:经验值若干(2%)
 * <p/>
 * Date: 2017/6/14
 * Time: 16:14
 *
 * @author Tian.Dong
 */
public class S10_luochengdazhan extends ScriptAction {
    @Override
    public void doAction(GameClient gameClient) throws IOException {
        String steps = "【雒城大战】1-Pre=25532=0==2=0==0=False=0=0=0\n" +
                "【雒城大战】1=25531=2=1150,900=0=0==0=True=7=0=0\n" +
                "【雒城大战】2=25534=1=250,940=0=0==0=True=6=0=0\n" +
                "【雒城大战】3=25524=4=2810,700=0=0==0=True=5=0=0\n" +
                "【雒城大战】4=25524=5=2990,700=0=0==0=True=1=0=0\n" +
                "【雒城大战】5=25435=8=910,840=0=0==0=False=7=21=0\n" +
                "【雒城大战】6=25041=0==1=3==0=True=8=0=0\n" +
                "【雒城大战】7-Pre=25502=0==2=0==0=False=0=0=0\n" +
                "【雒城大战】7=25504=3=1950,320=0=0==0=False=8=6=0\n" +
                "【雒城大战】8=25504=3=1950,320=0=0==0=False=9=0=0";
    }
}
