package tk.gbl.core.script.work.suipian;

import tk.gbl.core.GameClient;
import tk.gbl.core.ScriptAction;

import java.io.IOException;

/**
 * 任务名称-挑灯夜战
 * 触发条件-需完成‘雒城大战’的任务
 * 触发地点-益州、雒城
 * 流程-
 * 1.进入富户与吴懿交谈后，前往葭萌关(右进场景)。
 * 2.到达时会触发剧情，再前往葭萌树林(左上传点)触发剧情，答应收集【火把】(葭萌通道-墙上有2支)。
 * 3.收集完后返回葭萌树林(左上传点)触发剧情，再移动至葭萌关触发剧情，答应协助。
 * 4.至白水关取得【夜光玉杯】后，前往南郑贫户与杨松交谈，再返回葭萌关。
 * 5.到达葭萌关触发剧情后，前往葭萌帐与马超交谈，依序回答：杀父之仇、韩遂有切齿之恨、杨松以见张鲁之面、刘皇叔一人吗!、衣带诏之盟,立誓共诛曹贼!
 * 6.回答完毕后，返回葭萌关触发剧情，即可完成任务。
 * ->获得物品:经验值若干(0.5%)、大福神
 * <p/>
 * Date: 2017/6/14
 * Time: 16:14
 *
 * @author Tian.Dong
 */
public class S11_tiaodengyezhan extends ScriptAction {
    @Override
    public void doAction(GameClient gameClient) throws IOException {
        String steps = "【挑灯夜战】1=25107=1=370,340=0=0==0=True=54=0=0\n" +
                "【挑灯夜战】2=25413=0==1=4==0=True=14=0=0\n" +
                "【挑灯夜战】3=25415=0==1=6==0=True=22=0=0\n" +
                "【挑灯夜战】4=25415=0==1=6==0=True=15=0=0\n" +
                "【挑灯夜战】5=25413=0==1=4==0=True=15=0=0\n" +
                "【挑灯夜战】6=25175=1=410,320=0=0==0=True=11=0=0\n" +
                "【挑灯夜战】7=25413=0==1=4==0=True=21=0=0\n" +
                "【挑灯夜战】8=25416=2=610,420=0=0=1-0,3-0,2-4,2-1,1-8=0=False=10=0=0\n" +
                "【挑灯夜战】9=25413=0==1=4==0=True=13=0=0";
    }
}
