package tk.gbl.core.script.work.suipian;

import tk.gbl.core.GameClient;
import tk.gbl.core.ScriptAction;

import java.io.IOException;

/**
 * 任务名称:摆驾迎张松
 * 地区:荆北、江陵城
 * 任务条件:LV25
 * 流程:
 * 1.进入江陵富户与诸葛亮交谈后，答应协助。
 * 2.收集「看守长眼蟹」、「宫廷酒」、【晶透玉杯】(江陵普户-宗预)各一后，返回与诸葛亮交谈，答应协助。
 * 3.前往景山山洞(指示牌附近移动)会和张松交谈，答应协助。
 * 4.前往江陵城城门进行一段剧情后，再前往江陵富户(往上移动)后会自行交谈，答应收集。
 * 5.收集「疗伤膏」、「戒空药水」各一后，返回江陵富户(往上移动)后会自行交谈，答应协助。
 * 6.由江陵城门移动至江陵树林后，(由传点往左移动至张松出现)与张松交谈后，再与刘备交谈即可完成任务。
 * 任务奖品:经验值若干(2%)、[随机取得]骏马x2
 * 备注:
 * <p/>
 * Date: 2017/6/14
 * Time: 16:11
 *
 * @author Tian.Dong
 */
public class S1_baijiayingzhangsong extends ScriptAction {
    @Override
    public void doAction(GameClient gameClient) throws IOException {
        String steps = "1摆驾迎张松-江陵富户(诸葛亮)=21107=2=470,320=0=0==0\n" +
                "1摆驾迎张松-江陵富户(比料)=21107=2=470,320=0=0==0\n" +
                "1摆驾迎张松-景山山洞(张松)=21522=0=390,260=1=4==0\n" +
                "1摆驾迎张松-江陵城门=21011=0=280,600=1=5==0\n" +
                "1摆驾迎张松-江陵富户=21108=0=390,450=1=2==0\n" +
                "1摆驾迎张松-江陵富户(比料)=21108=0=390,450=1=2==0\n" +
                "1摆驾迎张松-江陵树林=21881=0=1130,400=1=5==0\n" +
                "1摆驾迎张松-江陵树林(张松)=21881=11=1130,400=0=0==0\n" +
                "1摆驾迎张松-江陵树林(刘备)=21881=14=1250,420=0=0==0";
        gameClient.doStepsDoDoScriptAction(steps);
        System.out.println("完成摆驾迎张松");
    }
}
