package tk.gbl.core.script.work.suipian;

import tk.gbl.core.GameClient;
import tk.gbl.core.ScriptAction;

import java.io.IOException;

/**
 * 任务名称:涪水相会
 * 地区:荆北、江陵城
 * 任务条件:需完成「刘备入蜀」的任务
 * 流程:
 * 1.进入官府(刘备、庞统出现)与庞统交谈后，答应协助。
 * 2.前往成都官府2(往内移动)与刘璋交谈后，答应协助。
 * 3.前往成都城门(接近传点)触发剧情后，获得【张松绝密信】。
 * 4.前往涪水刘璋营(由木栏进入)时与刘备交谈后，再与刘璋交谈。
 * 5.进入涪水刘备营的刘备大帐与刘备交谈后，获得【凤雏锦囊】。
 * 6.进入黄忠帐与魏延交谈后，出去帐外(1600,850触发)与刘备交谈后触发剧情。
 * 7.之后会与魏延、刘封进行战斗(需二回合内完成)。
 * 8.战斗胜利后，会与张任、冷苞、刘贵进行战斗(需二回合内完成)。
 * 9.战斗胜利后，与刘备连续交谈2次即可完成任务。
 * 任务奖品:经验值若干(2%)、LV96属性知手(知+30、防-3、属性+2)
 * 备注:
 * <p/>
 * Date: 2017/6/14
 * Time: 16:20
 *
 * @author Tian.Dong
 */
public class S4_beishuixianghui extends ScriptAction {
    @Override
    public void doAction(GameClient gameClient) throws IOException {
        String steps = "【涪水相会】1=21302=0=210,470=1=2==0=False=0=0=0\n" +
                "【涪水相会】2=21302=10=530,380=0=0==0=True=14=0=0\n" +
                "【涪水相会】3=25302=1=290,340=0=0==0=True=22=0=0\n" +
                "【涪水相会】4=25001=0==1=3==0=True=25=0=0\n" +
                "【涪水相会】4-检查点==0==11=0==29218=False=52=0=0\n" +
                "【涪水相会】5-Pre=25705=0==2=0==0=False=0=0=0\n" +
                "【涪水相会】5=25701=0==1=7==0=False=10=0=0\n" +
                "【涪水相会】6=25701=12=1830,900=0=7==0=False=19=0=0\n" +
                "【涪水相会】7=25701=7==1=7==0=True=4=0=0\n" +
                "【涪水相会】8=25701=7=1690,900=0=0==0=True=10=0=0\n" +
                "【涪水相会】9=25707=1=890,420=0=0==0=True=21=0=0\n" +
                "【涪水相会】9-检查点==0==11=0==29219=False=57=0=0\n" +
                "【涪水相会】10=25709=2=450,500=0=0==0=True=5=0=0\n" +
                "【涪水相会】11=25706=0=1650,600=1=6==0=True=9=0=0\n" +
                "【涪水相会】12=25706=8=1650,600=0=0==0=False=0=0=0\n" +
                "【涪水相会】13=25706=8=1650,600=0=0==0=True=4=0=0\n" +
                "【涪水相会】13-检查点==0==11=0==21747,21314,21749,21316,21750,21317=False=64=0=0";

        gameClient.doStepsDoDoScriptAction(steps);
        System.out.println("完成涪水相会");
    }
}
