package tk.gbl.core.script.work.suipian;

import tk.gbl.core.GameClient;
import tk.gbl.core.ScriptAction;

import java.io.IOException;

/**
 * 任务名称-义释严颜
 * 触发条件-需完成「落凤坡」的任务
 * 触发地点-荆北、江陵城
 * 流程-
 * 1.前往江陵城门(200,570)触发剧情后，答应辅助。
 * 2.前往益州巴郡帐与张飞交谈，再与凤儿(蝶儿)交谈后，答应辅助。
 * 3.前往巴郡城门(420,500)触发剧情后，返回巴郡帐。
 * 4.与张飞交谈后，再与凤儿(蝶儿)交谈，答应辅助。
 * 5.前往巴郡树林2右方与长斧队交谈后，返回巴郡帐。
 * 6.与张飞交谈后，再与凤儿(蝶儿)交谈，答应辅助。
 * 7.前往巴郡栈道2中间触发剧情后，会与严颜、杨洪、邓芝、威远军x7(增援：靖远兵x3)进行战斗。
 * 8.战斗胜利后，前往巴郡官府内进行对话后，答应辅助。
 * 9.前往德阳树林右上方触发剧情后，即可完成任务。
 * ->获得物品:经验值若干(2%)
 * <p/>
 * Date: 2017/6/14
 * Time: 16:13
 *
 * @author Tian.Dong
 */
public class S9_yishiyanyan extends ScriptAction {
    @Override
    public void doAction(GameClient gameClient) throws IOException {
        String steps = "【义释严颜】1=21011=0==1=5==0=True=15=0=0\n" +
                "【义释严颜】2=25862=1=530,460=0=0==0=True=16=0=0\n" +
                "【义释严颜】3=25031=0==1=4==0=True=9=0=0\n" +
                "【义释严颜】4=25862=1=530,460=0=0==0=True=7=0=0\n" +
                "【义释严颜】5=25863=5=1370,2040=0=0==0=True=11=0=0\n" +
                "【义释严颜】6=25862=1=530,460=0=0==0=True=11=0=0\n" +
                "【义释严颜】7=25865=0==1=3==0=True=5=5=0\n" +
                "【义释严颜】8=25309=0==1=2==0=True=18=0=0\n" +
                "【义释严颜】9=25871=0==1=2==0=True=13=0=0";
    }
}
