/**
 *  任务名称:美髯公的自傲
 地区:荆北、江陵城
 任务条件:LV25
 流程:
 1.进入江陵普户与关平交谈后，答应协助。
 2.前往成都官府与刘备交谈后，答应收集「唤彩织绸(打铁铺左边普户)」、
 「精绘陶瓶(邓芝屋内)」各一。
 3.收集齐全后返回官府与刘备交谈，再前往江陵普户与关平交谈，即可完成任务。

 任务奖品:经验值若干(0.5%)、天外酒x10
 备注:

 任务名称:遥唱双簧
 地区:益州、成都城
 任务条件:需完成「美髯公的自傲」的任务
 流程:
 1.进入成都官府与刘备交谈后，答应前往。
 2.进入富户(药铺左边)与诸葛瑾交谈后，再返回官府与刘备交谈取得【刘备亲笔信】。
 3.进入富户与诸葛瑾交谈后，前往江陵点兵台与关羽交谈，再返回成都城。
 4.进入官府与刘备交谈后，即可完成任务。

 任务奖品:经验值若干(1%)
 备注:

 任务名称:单刀赴会
 地区:荆北、江陵城
 任务条件:需完成「遥唱双簧」的任务
 流程:
 1.至江陵点兵台与关平交谈后，答应协助。
 2.依序前往长沙城门、零陵城门、桂阳村后，返回江陵点兵台与关平交谈。
 3.收集一把「墨铁刀(LV15、交趾城)」与【军令旗】(点兵台旁)后，再与关平交谈。(取得灵蔘炖鸡汤)
 4.前往陆口亭接近鲁肃触发剧情后，折回陆口码头(890,700)与关平交谈，即可完成任务。

 任务奖品:灵蔘炖鸡汤(修行值+100)、经验值若干(1%)、骏马
 备注:

 * Date: 2017/6/5
 * Time: 18:35
 *
 * @author Tian.Dong
 */
package tk.gbl.core.script.work.xiandou;