/**
 * 任务名称:巧遇黑山軍
 地区:青州、東郡
 任务条件:無
 流程:
 1.進入東郡樹林前，會與于氐根發生戰鬥。
 2.打贏後，在進入東郡之前，會再與黃龍發生戰鬥。
 3.打贏後即可玩進入。
 任务奖品:無
 备注:無

 任务名称:擊退黑山軍
 地区:青州、東郡
 任务条件:需完成巧遇黑山軍的任務
 流程:
 1.進入官府與王肱交談，答應幫他尋找救兵。
 2.到野外孔廟後方的與曹操交談，曹操加入隊伍。
 3.進入東郡城門前，會雷公阻檔，發生第一場戰鬥，勝利後得【泊江金沙】。
 4.第一場勝利後，隨即再度與李大目發生戰鬥，勝利後即可進入，得【薏仁漿】。
 5.進入官宅與王肱交談。
 6.到東郡野外上方的頓丘樹林，一進入便會與五鹿發生戰鬥，勝利後即可進入。
 7.往右下方走，會與睦固發生戰鬥。
 9.勝利後，會與于毒、牛角、白雀發生戰鬥，勝利後得【細流鞋】。
 10.再回去找王肱即可完成任務。
 任务奖品:金創藥、泊江金沙、薏仁漿、細流鞋(敏+5、Lv.10)
 备注:無

 任务名称:黃巾討伐戰
 地区:青州、東郡
 任务条件:需完成擊退黑山軍任務
 流程:
 1.進入東郡官府與王肱交談，答應前去微山樹林找曹操。
 2.前往微山樹林與曹操交談，答應前往朝歌山洞。
 3.進入朝歌山洞內，在洞內會遇見卞喜，與他交談，會與卞喜、王忠、于毒、白繞、於夫羅進入戰鬥。
 4.勝利後在繼續往洞內走，會遇見蔡陽，與他交談，會與蔡陽、車冑、路招、秦琪、馮楷進入戰鬥。
 5.勝利後，曹操與劉曄會出現，在答應前往相縣樹林，即可完成任務。
 任务奖品:行軍帳x5
 备注:無

 任务名称:匡亭追擊戰
 地区:徐州、相縣樹林
 任务条件:需完成黃巾討伐戰任務
 流程:
 1.前往徐州的相縣樹林，進入樹林往左下方走，進入第二層，與劉詳交談，會與劉詳、俞涉、荀正、袁嗣進入戰鬥。
 2.勝利後在前往盱眙水洞迷宮，在洞內會遇見惠衢，與他交談，會與惠衢、萇奴、韓胤、荀正、鄭泰進入戰鬥。
 3.勝利後，走出迷宮，在盱眙水寨的軍帳內與袁術交談，會與袁術、雷薄、紀靈、張勳、閻象、陳蘭、楊弘進入戰鬥。
 4.勝利後，滿寵會出現請你東郡找曹操即可完成任務。
 任务奖品:大福神紋章、大福神、10隻福神
 备注:無

 任务名称:徐州復仇戰
 地区:青州、東郡
 任务条件:需完成匡亭追擊戰任務
 流程:
 1.進入東郡官府與曹操交談，答應協助他。
 2.前往徐州的下蔡樹林，進入後往左上方走，與曹豹交談，會與曹豹、呂由、陳登、陳珪、應邵進入戰鬥。
 3.勝利後，前往跨州山洞，在洞內會遇見受傷的士兵，與他交談，會與劉備、關羽、張飛、趙雲進入戰鬥。
 4.勝利後，在回去東郡找曹操即可完成任務。
 任务奖品:亂擊紋章
 备注:無

 任务名称:兗州爭奪戰
 地区:青州、東郡
 任务条件:需完成徐州復仇戰的任務
 流程:
 1.到東郡官邸語曹操交談，棗祇會出現，答應協助。
 2.前往泰山山洞，在第二層會遇見玄武兵，與他交談，會與張超、張邈、詹茲、劉翊進入戰鬥。
 3.勝利後在前往第四層，在裡面會遇見臧霸，與他交談，會與毛暉、臧霸、曹性、郝萌、成廉、徐翕進入戰鬥。
 4.勝利後，與家僕交談。
 5.再回到東郡，進入東郡近郊與兗州兵交談，會與宋憲、張遼、陳宮、高順、魏續、侯成進入戰鬥。
 6.勝利後，在前往陳留樹林第二層與高雅交談，會與郭貢、張超、高雅、張邈、吳資、侯成、氾嶷進入戰鬥。
 7.勝利後，再前往許昌山洞與薛蘭交談，會與成廉、曹性、郝萌、李封、侯成進入戰鬥。
 8.勝利後繼續進入，會遇見一個黑衫軍，與他交談，再到他身後與呂布交談，會與魏續、陳宮、呂布、張遼、臧霸、高順、宋憲進入戰鬥。
 9.勝利後，進入許昌城與曹崇交談，曹操會出現，再與曹操交談，答應協助即可完成任務。
 任务奖品:合金戰甲(防+18、敏-3、Lv.50)
 备注:無

 任务名称:奉迎天子
 地区:兗州、穎川村
 任务条件:需完成兗州爭奪戰
 流程:
 1.進入穎川村茶店旁的小屋內與董昭交談。
 2.再到洛陽皇陵，進入皇陵前，會遭到韓暹阻擋，與韓暹交談，會與李樂、韓暹、胡才進入戰鬥，勝利後即可進入。
 3.再洞內第一個十字路口往上直走，與楊奉交談，會與史喚、徐晃、楊奉、宋果、韓浩進入戰鬥。
 4.勝利後，再往洞內走道最底，與飛熊將軍交談，李傕會出現，與李傕交談，選擇上前助陣，會與崔勇、李別、李傕、郭汜、李暹、夏育進入戰鬥。
 5.勝利後，回到許昌城點兵台與曹操交談即可完成任務。
 任务奖品:遁甲天書(知+14)
 备注:無

 任务名称:清水慘敗
 地区:兗州、宛城
 任务条件:需完成奉迎天子任務
 流程:
 1.到宛城小屋內曹安民交談，在去找張繡交談。
 2.再回去找曹安民交談，會與六個威武軍進入戰鬥。
 3.勝利後前往舞陰樹林與曹操交談，會與張先、雷敘、張碩、鄧濟進入戰鬥。
 4.勝利後，再前往千毒洞，再洞內遇見典韋，與他交談，會與韓晞、張繡、胡車兒、文聘、賈詡、陳生、黃射、張虎、劉虎、蔡瑁、劉表進入戰鬥。
 5.勝利後再回許昌城閱兵台與曹操交談即可完成任務。
 任务奖品:心係兌換卷、惡魔兌換卷、背包兌換卷
 备注:無

 任务名称:壽春圍城戰
 地区:兗州、許昌城
 任务条件:需完成清水慘敗的任務
 流程:
 1.到許昌城點兵台與程昱交談，答應協助。
 2.到徐州芒碭山又上方第二層，進入後與左上方的狼兵交談，會與許乾進入戰鬥。
 3.網羅許乾，再回到許昌與程昱交談。
 4.再到成德山洞，在洞內與殘兵交談，會與袁嗣、張多、鄭寶、李業進入戰鬥。
 5.勝利後，前往壽春山洞，在洞內與長刀兵交談，會與袁胤、進入戰鬥。
 6.勝利後，在進入與橋蕤交談，會與橋蕤、梁剛、陳紀、李豐、金尚、樂就進入戰鬥。
 7.勝利後即可完成任務。
 任务奖品:獵隼之羽(火+2)
 备注:無

 任务名称:白門樓擒呂布
 地区:兗州、許昌城
 任务条件:需完成壽春圍城戰
 流程:
 1.到許昌城點兵台與郭嘉交談，答應協助。
 2.前往徐州相縣樹林，進入第二層後往左方走，與侯諧交談，會與劉何、趙庶、李鄒、秦宜祿、侯諧進入戰鬥。
 3.勝利後，到淮陰樹林，進入後往右上方走，與許汜交談，會與王楷、許汜、曹性、郝萌、成廉進入戰鬥。
 4.勝利後，再到下邳城，進入下邳大街，與侯成交談，答應協助。
 5.蒐集治傷丸x3(鄴城藥舖)、將軍酒x3(徐州客棧)、伏虎金剛繩(徐州城杜平房內15171)一個。
 6.蒐集完後交給侯成。
 7.前往下邳北門，走上城門，會與戴乾、徐宣、陳矯進入戰鬥。
 8.勝利後，繼續往前走，會與張遼、陳宮、高順、陳群、袁渙進進入戰鬥。
 9.勝利後，與呂布交談，會與四色呂布進入戰鬥。
 10.勝利後在回去許昌城點兵台與郭嘉交談即可完成任務。
 任务奖品:三思錦囊、回憶錦囊、沁心的香包、駿馬x2、名駒x3
 备注:無

 任务名称:貂蝉回乡
 地区:徐州、下邳城
 任务条件:需完成白门楼擒吕布的任务
 流程:
 1.到下邳城北门与右方的下邳兵交谈，在与貂蝉交谈，答应协助。
 2.搜集一张小块皮(15101 下邳富户)给他，会与宋宪、魏续、侯成、豺狼军x5进入战斗。
 3.胜利后，在与夏侯尚交谈，会与陈群、夏侯尚、曹纯、董昭、禁卫军x4进入战斗。
 4.胜利后，在与曹操交谈，选择迎战，会与许褚、徐晃、曹操、张辽、郭嘉、禁卫军x5进入战斗。
 5.胜利后，再到并州河东城与黄小二交谈即可完成任务。
 任务奖品:染发剂、换肤面膜、定神纹章(Lv.20)、北海冰晶
 备注:

 任务名称:十面埋伏
 地区:兗州、官渡曹寨
 任务条件:需完成官渡大寨的任務
 流程:
 1.到官渡曹寨與曹洪交談，答應協助。
 2.前往牧野樹林與玄武兵交談，會與袁尚、劉放、李孚、沮宗、沮授進入戰鬥。
 3.勝利後再回官渡曹寨與曹操交談。
 4.在與程昱交談，答應協助。
 5.再到牧野樹林與玄武兵交談。
 6.再到河內樹林第二層與烈武軍交談，會與春卿、辛毗、審榮、張子謙、陰夔進入戰鬥。
 7.勝利後，在與袁譚交談，會與荀甚、岑壁、袁譚、袁熙、韓珩進入戰鬥。
 8.勝利後，在與袁尚交談，會與沮鵠、高柔、袁尚、高幹、辛評進入戰鬥。
 9.勝利後，在與袁紹交談，會與蘇由、蔣義渠、袁紹、審配、郭圖進入戰鬥。
 10.勝利後即可完成任務。
 任务奖品:獲得經驗直若干
 备注:無
 任务名称:汝南再破劉備
 地区:冀州、河內樹林
 任务条件:需完成十面埋伏的任務
 流程:
 1.十面埋伏任務完成後，與曹操交談，答應協助。
 2.前往汝南城與許褚交談，答應協助。
 3.前往臥牛山洞，與劉辟交談，會與龔都、劉辟、徐和、裴元紹進入戰鬥。
 4.勝利後，再到弋陽樹林第二層，與瞿恭交談，會與江宮、瞿恭、張赤、沈成進入戰鬥。
 5.勝利後，在與陳震交談，會與糜芳、廖化、陳震、陳到、糜竺進入戰鬥。
 6.勝利後，再到穰山樹林，與黃巾山兵交談，會與簡雍、關平、劉備、周倉、孫乾進入戰鬥。
 7.勝利後，再到穰山洞窟，與黃巾山兵交談，會與關銀屏、張飛、劉備、關羽、趙雲進入戰鬥。
 8.勝利後即可完成任務。
 任务奖品:名駒x1、昇華丹
 备注:無

 * Date: 2017/4/26
 * Time: 16:01
 *
 * @author Tian.Dong
 */
package tk.gbl.core.script.work.qinxinxiangbao;