/**
 * 1.水盘古 先到青州蓬莱村跟海大哥接任务,再出海往上走,进入坐标为(490,1790)的地图(坐标是630,1790的地图是去蓬莱仙岛,高句丽和诿国的,打风,火盘古,地苍穹),一直右上角走到(2410,200).打完水盘古就有点数.
 地图略

 2.风盘古 不需要接任务,出蓬莱村(使用WG的地图功能直接点切换点去比较快,下同),出海往上走进入坐标为(630,1790)的地图(坐标是490,1790的地图是打水盘古抓水豆的地方),右上走,进入传送点,进入高丽后看到前方的长白山洞就是打风盘古地方.登陆点横坐标2003(可WG直接飞洞),登陆以后左走去长白山洞,门口有剧情,盘古在中上位置(A点),打完出来在洞口要再打一次(B点,这次就盘古1个,无小兵).打完就有点数.
 3.火盘古 出蓬莱村,出海往上走进入坐标为(630.1790)的地图,去地图中间的蓬莱岛找北斗星君接任务,出岛右上走进入传送点,进入高丽后再一直右走,再过传送点到诿国,在水路找到倭国海洞,洞口有剧情,先下走再右走,来到一个都是岩浆的地方(C点)有8只小兵的战斗,打完上走就碰到火盘古,切记要选择否才能打盘古,打完去蓬莱仙岛找北斗星君拿点数.( 选择是就不能打了,直接得到炬炎戟(攻+11敏-1等级35),没点数,不可挽回)

 4.地盘古 来到徐州,再过萧关(过了萧关的可直接WG飞宛城客栈),到左上角的宛城.到宛城客栈接任务,再与街上李父说话.然后上面走,穿过树林来到千毒洞.盘古在左中位置(B点),.走到右中位置是死胡同,出来点上面墙壁回出现隐藏秘道(A点),遇到小兵可遁逃,剧情选择”继续往前走”,再右上走就碰到盘古.打完就有点数.

 5.水苍穹巨兽(江东) 来到扬州(庐江水寨下面很多船那里,打蒋钦进入江东再WG飞建业较为简单),飞建业城,在官府门口与韩当说话,再进官府与程普接任务,出官府后右走穿过街道进入建业森林,上走进入太湖水洞.巨兽在右下位置.(B点),打完就有点数.
 6.地苍穹巨兽 出蓬莱村(或直接WG飞娄桂部),出海往上走进入横坐标为(630,1790)的地图,右上走进入传送点,进入高丽后看到前方的长白山洞是打风盘古的地方.登陆点横坐标2003,登陆以后左走去长白山洞右下方的小村子(娄桂部),村子最左边屋子跟柏固接任务,出村子一直右上走来到辰韩山洞,巨兽在右上位置(图暂缺),打完再去跟柏固拿技能点.


 7.风苍穹巨兽(辽东) 出新手城,过卢龙口来到有管宁那张地图,一直右上走打过几个公孙X就来到辽东.过个山洞(WG飞望平村,或者一直上面走过山洞),右上走来到望平村,跟右下角的阿义说话,再进阿义旁边屋子跟凉茂接任务.出村子后右走进辽东雪洞,一直又走到底再上走就遇到巨兽,打完回望平村找凉茂拿点数。
 8.火苍穹巨兽 到辽东乌桓部落与苏仆延交谈，再到单于大帐内与蹋顿交谈，答应协助，前往白狼雪洞，往洞的左中方向走（图暂缺），在洞内与牛巨汉交谈，会与苍穹巨兽、熊巨汉＊２、牛巨汉＊７进入战斗，胜利后回去与蹋顿交谈完成任务，得到属性点+1。




 * 蟠桃延寿
 1.到仙界灵虚山与人虎仙交谈，会与人虎仙进入战斗。
 2.胜利后，答应协助老仙婆。
 3.前往蟠桃小径与仙女交谈，会与仙女x5进入战斗。
 4.胜利后，得【王母娘娘的蟠桃】。
 5.再回去灵虚山顶的小屋与老仙婆交谈即可完成任务。
 任务前提：LV.25
 随机获得：骏马x1、福神x5、大福神x3

 * 瑶池求仙甲
 1.到仙界灵虚山与老仙婆交谈，答应协助
 2.到瑶池与万年龟仙交谈，会与赑屃进入战斗。
 3.胜利后，得【赑屃的仙甲】。
 4.再回去与老仙婆交谈即可完成任务。
 任务前提：需完成蟠桃延寿的任务
 随机获得：七彩羽毛(?+5)

 神秘的侵入者
 1.到仙界祭坛与太白星君交谈，答应协助。
 2.先前往东边的岁星之域，在第二层与飒林妖交谈，会与飒林妖x8进入战斗。
 3.胜利后，再到西边的太白之域与祸水妖交谈，会与祸水妖x8进入战斗。
 4.胜利后，再到南边的荧惑之域与焚天妖交谈，会与焚天妖x8进入战斗。
 5.胜利后，再到北边的辰星之域与封地妖交谈，会与封地妖x8进入战斗。
 6.胜利后回去与太白星君交谈即可完成任务。
 任务前提：需完成八只巨兽的任务。
 随机获得：通天魔豆


 危机·转机
 1.到仙界灵虚山与老仙婆交谈，答应协助。
 2.到储藏室与小仙童交谈，会与九闇魅姬、邪影鬼使x2进入战斗。
 3.胜利后，到仙界祭坛与太白星君交谈即可完成任务
 任务前提：需完成瑶池求仙甲、神秘的侵入者的任务、LV.120
 任务奖励：转生
 *
 * @author Tian.Dong
 */
package tk.gbl.core.script.work.zhuansheng;